{
  "nodes": [
    {
      "id": "ELEC 201",
      "title": "Circuit Analysis I",
      "credits": 4,
      "desc": "The fundamentals of analysis of lumped linear time-invariant circuits; network theorems; operational amplifiers; first order circuits; DC analysis of diodes, BJT, and FET circuits. This course is not eligible for Credit/D/Fail grading. [4-2*-2*]\nPrerequisite: MATH 101 and one of PHYS 108, PHYS 118, PHYS 158.\nCorequisite: One of MATH 255, MATH 256, MATH 265.\n"
    },
    {
      "id": "ELEC 202",
      "title": "Circuit Analysis II",
      "credits": 4,
      "desc": "Phasor analysis and AC three phase systems power; transfer functions; Bode plots; filters and resonance; Laplace transforms; transformers and mutual inductance; two-port networks. First and second order circuits. This course is not eligible for Credit/D/Fail grading. [4-0-1]\nPrerequisite: All of PHYS 158, MATH 101 and one of ELEC 201, ELEC 203 and one of MATH 255, MATH 256.\n"
    },
    {
      "id": "ELEC 203",
      "title": "Basic Circuit Analysis",
      "credits": 3,
      "desc": "Ideal passive elements and sources; Kirchhoff's Laws; DC circuits; natural and complete response of first order circuits; operational amplifiers; impedance; phasors; complex power. Not open to students in Electrical and Computer Engineering. This course is not eligible for Credit/D/Fail grading. [3-2*-1]\nCorequisite: One of MATH 255, MATH 256.\n"
    },
    {
      "id": "ELEC 204",
      "title": "Linear Circuits",
      "credits": 4,
      "desc": "Basic concepts and analysis techniques in the context of electric and electronic circuits including Bode plots and the Laplace transform. Treatment of RLC circuits, phasors, op-amps. Introduction to nonlinear circuit elements, diodes, BJT, FET circuits. This course is not eligible for Credit/D/Fail grading. [4-0-1]\nPrerequisite: MATH 152 and one of PHYS 108, PHYS 118, PHYS 158.\nCorequisite: One of MATH 256, MATH 255.\n"
    },
    {
      "id": "ELEC 205",
      "title": "Electronics Laboratory",
      "credits": 1,
      "desc": "Experiments involving electronic devices and circuits. This course is not eligible for Credit/D/Fail grading. [0-2*-0]\nCorequisite: ELEC 204.\n"
    },
    {
      "id": "ELEC 211",
      "title": "Engineering Electromagnetics",
      "credits": 2,
      "desc": "Electrostatics, electric currents, dielectrics, capacitance, electrostatic potential, magnetostatics. This course is not eligible for Credit/D/Fail grading. [2-0-1]\nPrerequisite: One of MATH 263, MATH 253 and one of PHYS 108, PHYS 118, PHYS 158.\nCorequisite: MATH 264.\n"
    },
    {
      "id": "ELEC 221",
      "title": "Signals and Systems",
      "credits": 4,
      "desc": "Complex numbers, LTI systems, convolution sum, discrete-time Fourier series and transforms, z-transform, sampling, introduction to filtering and modulation, feedback systems, stability. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: One of MATH 256, MATH 255.\n"
    },
    {
      "id": "ELEC 271",
      "title": "Selected Topics in Biomedical Engineering",
      "credits": 1,
      "desc": "Effective communication in a multi-disciplinary environment, introduction to emerging areas of biomedical engineering and biotechnology, ethics, and responsibility. Restricted to students admitted to the Biomedical Engineering program in Electrical Engineering. This course is not eligible for Credit/D/Fail grading. [1-0-0]\nCorequisite: ELEC 202.\n"
    },
    {
      "id": "ELEC 281",
      "title": "Technical Communication",
      "credits": 3,
      "desc": "Written and oral communication in engineering. Technical description, report preparation, business correspondence, and oral presentation of technical material. Restricted to students in second year of Electrical and Computer Engineering programs. Credit will be granted for only one of ELEC 281, CPEN 281, BMEG 201 or APSC 201. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\n"
    },
    {
      "id": "ELEC 291",
      "title": "Electrical Engineering Design Studio I",
      "credits": 6,
      "desc": "Design projects involving electronic devices and circuits, electromagnetics, signals and systems, and microcomputers. This course is not eligible for Credit/D/Fail grading. [2-6-0]\nPrerequisite: All of ELEC 201, CPEN 211.\n"
    },
    {
      "id": "ELEC 292",
      "title": "Biomedical Engineering Design Studio",
      "credits": 6,
      "desc": "Design projects involving electronic devices and circuits, electromagnetics, signals and systems, microcomputers with applications in biomedical engineering. Final group project requiring oral presentation of student-prepared slides. This course is not eligible for Credit/D/Fail grading. [2-6-0]\nCorequisite: All of ELEC 201, CPEN 211, ELEC 221.\n"
    },
    {
      "id": "ELEC 301",
      "title": "Electronic Circuits",
      "credits": 4,
      "desc": "Analysis and design of electronic circuits; biasing of and small-signal models for transistors; frequency response of amplifiers; feedback and stability aspects of amplifier design; OP-AMPs; active filters; oscillators; IC specification and selection. Credit will only be given for one of EECE 356, ELEC 301, and EECE 374. This course is not eligible for Credit/D/Fail grading. [4-0-0]\nPrerequisite: Either (a) one of ELEC 201, ELEC 203 and ELEC 202;  or (b) ELEC 204.\n"
    },
    {
      "id": "ELEC 302",
      "title": "Electronic Circuits for Electromechanical Design",
      "credits": 3,
      "desc": "Semiconductor fundamentals; modelling of electronic devices including diodes and transistors; design of power supplies, waveform generators and logic circuits; signals in time and frequency domains; operational amplifiers; active filters; oscillators; device specification and selection. This course is not eligible for Credit/D/Fail grading. [3-2*-0]\nPrerequisite: One of ELEC 201, ELEC 203, ELEC 204, MECH 221.\n"
    },
    {
      "id": "ELEC 311",
      "title": "Electromagnetic Fields and Waves",
      "credits": 4,
      "desc": "Waves and propagation; Maxwell's equations; applications including transmission lines; impedance matching and Smith charts; reflection and refraction; waveguides and antennas. This course is not eligible for Credit/D/Fail grading. [4-0-0]\nPrerequisite: ELEC 211 and either (a) all of MATH 101, MATH 263, MATH 265, MATH 267 or (b) all of MATH 101, MATH 253, MATH 264, MATH 265, MATH 267 or (c) all of MATH 101, MATH 253, MATH 256, MATH 264.\n"
    }
  ],
  "edges": []
}
