[
    {
        "name": "BMEG 101",
        "title": "Introduction to Biomedical Engineering",
        "credits": 3,
        "desc": "Foundational material spanning the four streams of the BMEG undergraduate program. Topics include: sensors and instrumentation; biosignals; physiological modeling; biomechanics; biomaterials; cellular engineering; regenerative medicine; and engineering design in these contexts. [3-0-2*]\nPrerequisite: APSC 100.\nCorequisite: BMEG 102.\n",
        "coreqs": [
            "BMEG 102"
        ],
        "prereqs": [
            "BMEG 102"
        ],
        "postreqs": [],
        "x": 37,
        "y": 596,
        "group": "bmeg"
    },
    {
        "name": "BMEG 102",
        "title": "Biomedical Engineering Lab",
        "credits": 2,
        "desc": "Rapid prototyping of mechanical, electrical and electromechanical systems. Building parts with state of the art software and 3-D printing. Use of laboratory equipment and instrumentation. Credit will only be granted for one of BMEG 102 and BMEG 200. This course is not eligible for Credit/D/Fail grading. [1-2-0]\nPrerequisite: One of PHYS 12, PHYS 100\nCorequisite: BMEG 101.\n",
        "coreqs": [
            "BMEG 101"
        ],
        "prereqs": [
            "BMEG 101"
        ],
        "postreqs": [],
        "x": 36,
        "y": 610,
        "group": "bmeg"
    },
    {
        "name": "BMEG 200",
        "title": "Biomedical Engineering Bridge Module",
        "credits": 1,
        "desc": "Core concepts of biomedical engineering with a focus on advanced biological concepts that are inherent in biomechanics analysis, biomaterials signals and systems, bioinformatics and cellular bioengineering.Credit will only be granted for one of BMEG 102 and BMEG 200. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: All of APSC 101, PHYS 159.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 33,
        "y": 623,
        "group": "bmeg"
    },
    {
        "name": "BMEG 201",
        "title": "Technical Communication for Biomedical Engineers",
        "credits": 3,
        "desc": "Report preparation, business correspondence, and oral presentation in biomedical engineering specific cases and projects. Credit will be granted for only one of BMEG 201 or APSC 201. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 29,
        "y": 636,
        "group": "bmeg"
    },
    {
        "name": "BMEG 210",
        "title": "Thermodynamics in Biomedical Engineering",
        "credits": 3,
        "desc": "Work, heat and energy; material and energy balances; the first law and second law of thermodynamics; entropy and process reversibility; availability (energy) analysis; Hess's Law; thermodynamic properties of fluids; and applications to biomedical systems. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: PHYS 157. CHEM 123 is recommended\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 22,
        "y": 648,
        "group": "bmeg"
    },
    {
        "name": "BMEG 220",
        "title": "Circuits and Electromagnetics with Application to Biomedical Engineering",
        "credits": 4,
        "desc": "Electromagnetic phenomena in the  body; bioinstrumentation; electrostatic and electromagnetic fields, forces, capacitance and inductance; bio-effects of electromagnetic fields; and modelling electrical components of physiological and biomedical systems. This course is not eligible for Credit/D/Fail grading. [4-0-2*]\nPrerequisite: All of PHYS 158, MATH 253, MATH 256.\nCorequisite: MATH 264.\n",
        "coreqs": [
            "MATH 264"
        ],
        "prereqs": [
            "MATH 264"
        ],
        "postreqs": [],
        "x": 14,
        "y": 659,
        "group": "bmeg"
    },
    {
        "name": "BMEG 230",
        "title": "Biomechanics I",
        "credits": 4,
        "desc": "Integrating the study of two dimensional movement of animals and humans with the study of the manner in which forces on biomechanical structures such as bones, ligaments, tendons, muscles and joints cause motion. Techniques of solid mechanics and two dimensional rigid body dynamics. Students who have received credit for MECH 435 cannot also receive credit for BMEG 230 or BMEG 330. This course is not eligible for Credit/D/Fail grading. [4-2*-2*]\nPrerequisite: Either (a) all of BMEG 101, PHYS 170 or (b) all of APSC 101, BMEG 200, PHYS 170.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 5,
        "y": 669,
        "group": "bmeg"
    },
    {
        "name": "BMEG 245",
        "title": "The Fundamental Units of Life: From Cells To Systems",
        "credits": 4,
        "desc": "The structure and function of cells and how they are organized to generate tissues and organ systems [3-3*-0]\nPrerequisite: One of CHEM 12, CHEM 100. BIOL 12 strongly recommended\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -5,
        "y": 678,
        "group": "bmeg"
    },
    {
        "name": "BMEG 250",
        "title": "Cellular  Physiology  and Biophysics",
        "credits": 4,
        "desc": "Cellular structure and mechanisms of membrane transport, signal transduction, muscle mechanochemistry and neurotransmission. Structure and hierarchical organization up to the level of tissues. Light and electron microscopy. This course is not eligible for Credit/D/Fail grading. [3-1-0]\nPrerequisite: All of BMEG 245, MATH 256.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -16,
        "y": 685,
        "group": "bmeg"
    },
    {
        "name": "BMEG 257",
        "title": "Biomedical Engineering Design I",
        "credits": 4,
        "desc": "Engineering design process for biomedical technologies. Practical skills in engineering design, computer aided design, electronic circuits, programming, and rapid prototyping in the context of biomedical technologies. Introduction to broader ethical and sustainability considerations for biomedical technology design. This course is not eligible for Credit/D/Fail grading. [2-4-0]\nPrerequisite: Either (a) all of BMEG 101, BMEG 102 or (b) all of APSC 101, BMEG 200, PHYS 159.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -29,
        "y": 690,
        "group": "bmeg"
    },
    {
        "name": "BMEG 310",
        "title": "Introduction to Bioinformatics",
        "credits": 4,
        "desc": "Principles behind the methods of bioinformatics. The use of bioinformatics databases and tools for solving problems in genomics, proteomics, structural biology and evolutionary biology. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: BMEG 245 and one of CPEN 221, CPEN 223.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -42,
        "y": 694,
        "group": "bmeg"
    },
    {
        "name": "BMEG 320",
        "title": "Bioengineering Feedback Systems and Controls",
        "credits": 3,
        "desc": "Modelling, analysis and simulation of dynamic systems; system modelling by state space; linearization; feedback, stability and sensitivity; control system design. Examples from biological systems, assistive systems and biomedical equipment. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: Either (a) BMEG 220 or (b) all of ELEC 221, ELEC 201, ELEC 202.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -55,
        "y": 696,
        "group": "bmeg"
    },
    {
        "name": "BMEG 321",
        "title": "Biomedical Instrumentation",
        "credits": 3,
        "desc": "Fundamental working principles of medical instruments used for measurements of nervous, respiratory and circulatory systems with focus on biopotential signals. Other topics include medical imaging, as well as minimally invasive and robotic surgery. Credit will only be granted for one of BMEG 321, ELEC 371. This course is not eligible for Credit/D/Fail grading. [2-3-0]\nPrerequisite: Either (a) MATH 256 or (b) all of MATH 265, MATH 267;  and either (a) BMEG 220 or (b) one of ELEC 211, PHYS 301 and one of ELEC 201, ELEC 204.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -69,
        "y": 696,
        "group": "bmeg"
    },
    {
        "name": "BMEG 330",
        "title": "Biomechanics II",
        "credits": 3,
        "desc": "Principles and common elements of sports-, orthopaedic-, injury- and cellular length-biomechanics. Improving sports performance and preventing overuse injuries through sports biomechanics, designing orthopaedic implants through orthopaedic biomechanics, preventing injuries through injury biomechanics and identifying and filtering cancerous blood cells through cellular biomechanics. Students who have received credit for MECH 435 cannot also receive credit for BMEG 230 or BMEG 330. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: BMEG 230.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -83,
        "y": 694,
        "group": "bmeg"
    },
    {
        "name": "BMEG 350",
        "title": "Human Structure/Function from Cells to Systems",
        "credits": 4,
        "desc": "Human anatomy, histology and physiology with examples from biomedical engineering. Anatomical compartmentation and function regulation; homeostatic control systems, sensors and effectors; intercellular communication strategies; and cellular and organ function assessment. This course is not eligible for Credit/D/Fail grading. [4-0-0]\nPrerequisite: All of BMEG 245, BMEG 250.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -96,
        "y": 690,
        "group": "bmeg"
    },
    {
        "name": "BMEG 357",
        "title": "Biomedical  Engineering Design II",
        "credits": 3,
        "desc": "Creating innovations in biomedical technologies.  Supervised design process for clinical clients, involving the building, testing, and verification of prototypes with potential users. This course is not eligible for Credit/D/Fail grading. [3*-3*-0]\nPrerequisite: BMEG 257.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -108,
        "y": 685,
        "group": "bmeg"
    },
    {
        "name": "BMEG 371",
        "title": "Transport Phenomena within Cells and Tissues",
        "credits": 3,
        "desc": "Fluid flow and mass transport analysis within healthy and diseased cells and tissues using mathematics. Drug delivery and tissue engineering. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: One of MATH 253, MATH 217 and either (a) MATH 256 or (b) all of MATH 255, MATH 257.\nEquivalency: CHBE 470.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -120,
        "y": 678,
        "group": "bmeg"
    },
    {
        "name": "BMEG 372",
        "title": "Biomedical Materials and Drug Delivery",
        "credits": 3,
        "desc": "Biomaterials science/engineering applied to design and synthesis of drug delivery systems. Biomaterial types, synthesis and testing; the use of biomaterials; biological response; biocompatibility and degradation; drug delivery systems; nanocarriers; modification of polymers; liposomes and micelles; nucleic acid, transdermal and oral delivery. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: All of BMEG 250, CHEM 123.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -130,
        "y": 669,
        "group": "bmeg"
    },
    {
        "name": "BMEG 373",
        "title": "Microfluidics",
        "credits": 3,
        "desc": "Advantages and disadvantages of miniaturization of complex fluid flow processes. Manipulating liquid flow; electrophoretic velocity and mobility; serial dilution; capillary electrophoresis; integrated microfluidic platforms; and blood and the motility of bacteria. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: CHBE 251.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -140,
        "y": 659,
        "group": "bmeg"
    },
    {
        "name": "BMEG 374",
        "title": "Cellular Bioengineering: Laboratory & Design",
        "credits": 3,
        "desc": "Fundamental genetic, molecular, and tissue engineering techniques. Design of experiments and tools related to these essential cellular bioengineering techniques. [1-3-1]\nPrerequisite: BMEG 250.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -148,
        "y": 648,
        "group": "bmeg"
    },
    {
        "name": "BMEG 400",
        "title": "Topics in Biomedical Engineering",
        "credits": 1,
        "desc": "Lectures or projects on specialized topics in Biomedical Engineering. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -154,
        "y": 636,
        "group": "bmeg"
    },
    {
        "name": "BMEG 401",
        "title": "Economics of Healthcare Solutions",
        "credits": 3,
        "desc": "Canadian and USA engineering economics in BME and healthcare systems.  Economic equivalence, cost estimation, risk assessment, regulatory frameworks, economic optimization, intangible factors, ethics, sustainability, financial tools, commercialization and regulator regimes. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -159,
        "y": 623,
        "group": "bmeg"
    },
    {
        "name": "BMEG 410",
        "title": "Biomedical Equipment, Physiology, and Anatomy",
        "credits": 3,
        "desc": "Principles and operation of biomedical equipment for cardiovascular system, respiratory system, renal dialysis, endoscopy, surgery, and imaging. Functional relationships of biomedical equipment to physiology and anatomy of major body systems. Credit will be granted for only one of BMEG 410 or BMEG 510. [3-0-2*]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -161,
        "y": 610,
        "group": "bmeg"
    },
    {
        "name": "BMEG 420",
        "title": "Medical Imaging",
        "credits": 3,
        "desc": "Physical principles of ultrasound, magnetic resonance, computed tomography, X-ray projection imaging and molecular imaging in medical imaging for diagnostics, therapeutics and interventions. [3-0-0]\nPrerequisite: One of BMEG 220, BMEG 250 and one of BMEG 321, ELEC 371.\nEquivalency: ELEC 471.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -162,
        "y": 596,
        "group": "bmeg"
    },
    {
        "name": "BMEG 455",
        "title": "Professionalism and Ethics in Biomedical Engineering",
        "credits": 3,
        "desc": "Ethical, equity, and diversity issues and professionalism in Biomedical Engineering practice and design. Case studies and design projects will be used to expand on the foundation of biomedical engineering design, applying real-world ethical dilemmas including professional, medical, and research ethics. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -161,
        "y": 583,
        "group": "bmeg"
    },
    {
        "name": "BMEG 456",
        "title": "Clinical and Industrial Biomedical Engineering",
        "credits": 3,
        "desc": "Principles of clinical practice, Canadian healthcare system, medical approach to diagnosis, ethics and regulations for clinical trials, medical technology management, medical device development and standards, biostatistics. Credit will be granted for only one of BMEG 257, BMEG 456, BMEG 556. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -159,
        "y": 569,
        "group": "bmeg"
    },
    {
        "name": "BMEG 457",
        "title": "Biomedical Engineering Design Project",
        "credits": 6,
        "desc": "Capstone design and development of a practical biomedical device or system. Projects provided by local industry and engineering research laboratories. [1-3-1; 1-3-1]\nPrerequisite: All of BMEG 350, BMEG 357.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -154,
        "y": 556,
        "group": "bmeg"
    },
    {
        "name": "BMEG 470",
        "title": "Cellular  Responses  to Forces and Biomaterials",
        "credits": 3,
        "desc": "Mechanical forces and biomaterials regulating cellular functions critical to tissue development, regeneration and repair. [3-0-0]\nPrerequisite: All of BMEG 245, BMEG 250, BMEG 350.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -148,
        "y": 544,
        "group": "bmeg"
    },
    {
        "name": "BMEG 474",
        "title": "Stem Cells and Regenerative Medicine",
        "credits": 3,
        "desc": "Biology and applications of stem cells in regenerative medicine. Modelling human biology and disease in vitro and in vivo. Regulatory and commercialization pathways for regenerative medicine innovations. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: All of BMEG 245, BMEG 250, BMEG 350.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -140,
        "y": 533,
        "group": "bmeg"
    },
    {
        "name": "BMEG 490",
        "title": "Introduction to Academic Research",
        "credits": 3,
        "desc": "Research project directed by a faculty member in Biomedical Engineering. Course may include workshops. \nPrerequisite: Fourth-year standing and at least 80% average in third-year courses.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -130,
        "y": 523,
        "group": "bmeg"
    },
    {
        "name": "BMEG 500",
        "title": "Orientation to Clinical Environment",
        "credits": 1,
        "desc": "Operation of biomedical and clinical engineering facilities at hospitals. Daily activities of healthcare workers. Patients experience. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -120,
        "y": 515,
        "group": "bmeg"
    },
    {
        "name": "BMEG 501",
        "title": "Interdisciplinary Team Project in Medical Technology Innovation",
        "credits": 4,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -108,
        "y": 507,
        "group": "bmeg"
    },
    {
        "name": "BMEG 510",
        "title": "Anatomy and Physiology with Applications to Biomedical Devices",
        "credits": 4,
        "desc": "Anatomical structures and physiological principles of major body systems.  Functional connections to operation of diagnostic and therapeutic equipment.  Exploration of recent advances. Credit will be granted for only one of BMEG 410 or BMEG 510. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -96,
        "y": 502,
        "group": "bmeg"
    },
    {
        "name": "BMEG 511",
        "title": "Fundamentals of Applied Pathophysiology in Biomedical Engineering",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -83,
        "y": 498,
        "group": "bmeg"
    },
    {
        "name": "BMEG 550",
        "title": "Biomedical Engineering Technology",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading. [3-3*-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -69,
        "y": 496,
        "group": "bmeg"
    },
    {
        "name": "BMEG 554",
        "title": "Directed Studies in Biomedical Engineering",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -55,
        "y": 496,
        "group": "bmeg"
    },
    {
        "name": "BMEG 556",
        "title": "Clinical and Industrial Biomedical Engineering",
        "credits": 3,
        "desc": "Principles of professional engineering practice, the Canadian healthcare system, medical approach to diagnosis, principles and management of common medical devices, ethics and regulations for clinical trials, codes and regulations of medical devices, applications of biomedical engineering. Credit will be granted for only one of BMEG 456 or BMEG 556. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -42,
        "y": 498,
        "group": "bmeg"
    },
    {
        "name": "BMEG 557",
        "title": "Statistical Methods for Evaluating Medical Technologies",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -29,
        "y": 502,
        "group": "bmeg"
    },
    {
        "name": "BMEG 580",
        "title": "Biomedical Engineering Topics at the Interface of Medicine and Engineering",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -16,
        "y": 507,
        "group": "bmeg"
    },
    {
        "name": "BMEG 581",
        "title": "Professional and Academic Development",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -5,
        "y": 515,
        "group": "bmeg"
    },
    {
        "name": "BMEG 590",
        "title": "Biomedical Engineering Professional Skills",
        "credits": 1,
        "desc": "Formulate and implement a professional skills development plan involving workshops on topics such as writing, presentation, teaching, finance, marketing, equity, ethics.  Pass/Fail grading. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 5,
        "y": 523,
        "group": "bmeg"
    },
    {
        "name": "BMEG 591",
        "title": "Topics in Biomedical Engineering",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 14,
        "y": 533,
        "group": "bmeg"
    },
    {
        "name": "BMEG 597",
        "title": "Master of Engineering Project",
        "credits": 6,
        "desc": "Supervised industrial, clinical, or research project for students registered in Biomedical Engineering program. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 22,
        "y": 544,
        "group": "bmeg"
    },
    {
        "name": "BMEG 598",
        "title": "Biomedical Engineering Seminar",
        "credits": 1,
        "desc": "Presentation and discussion of current topics in biomedical engineering research and development. A required course for all graduate students in Biomedical Engineering. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 29,
        "y": 556,
        "group": "bmeg"
    },
    {
        "name": "BMEG 599",
        "title": "M.A. Sc. Thesis",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 33,
        "y": 569,
        "group": "bmeg"
    },
    {
        "name": "BMEG 699",
        "title": "Doctoral Dissertation",
        "credits": 0,
        "desc": "\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 36,
        "y": 583,
        "group": "bmeg"
    }
]