[
    {
        "name": "CHBE 201",
        "title": "Integrated Technical Communication",
        "credits": 3,
        "desc": "Written and oral communication in chemical and biological engineering: business correspondence, laboratory reports, technical description, and poster presentations. Restricted to students in second year of the Chemical and Biological Engineering programs. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\nCorequisite: CHBE 220.\n",
        "coreqs": [
            "CHBE 220"
        ],
        "prereqs": [
            "CHBE 220"
        ],
        "postreqs": [],
        "x": 350,
        "y": 433,
        "group": "chbe"
    },
    {
        "name": "CHBE 220",
        "title": "Founding Principles in Chemical and Biological Engineering I",
        "credits": 4,
        "desc": "Introduction to Chemical and Biological Engineering profession and the physical sciences that form the founding principles of the discipline. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: All of CHEM 154, MATH 101.\nCorequisite: CHBE 201.\n",
        "coreqs": [
            "CHBE 201"
        ],
        "prereqs": [
            "CHBE 201"
        ],
        "postreqs": [],
        "x": 349,
        "y": 439,
        "group": "chbe"
    },
    {
        "name": "CHBE 221",
        "title": "Founding Principles in Chemical and Biological Engineering II",
        "credits": 4,
        "desc": "Introduction to Chemical and Biological Engineering profession with emphasis on the biological sciences that form the founding principles of the discipline. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: CHBE 220.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 349,
        "y": 445,
        "group": "chbe"
    },
    {
        "name": "CHBE 230",
        "title": "Computational Methods",
        "credits": 3,
        "desc": "Mathematical formulation of chemical and biological engineering problems; standard techniques of numerical analysis and their application to chemical, environmental and biotechnological systems; program development; use of commercial numerical analysis software. This course is not eligible for Credit/D/Fail grading. [2-0-2]\nPrerequisite: APSC 160.\nCorequisite: MATH 256.\n",
        "coreqs": [
            "MATH 256"
        ],
        "prereqs": [
            "MATH 256"
        ],
        "postreqs": [],
        "x": 348,
        "y": 451,
        "group": "chbe"
    },
    {
        "name": "CHBE 241",
        "title": "Material and Energy Balances",
        "credits": 3,
        "desc": "Introduction to Chemical and Biological Engineering; units; stoichiometry; phase equilibria; material balances; energy balances. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: All of CHEM 154, MATH 152.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 346,
        "y": 457,
        "group": "chbe"
    },
    {
        "name": "CHBE 243",
        "title": "Introduction to Chemical and Biological Engineering Process and Technology",
        "credits": 1,
        "desc": "Processes used in chemical and biological industries, which emphasize underlying physical, chemical, and biological principles. This course is not eligible for Credit/D/Fail grading. [1-0-1*]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 345,
        "y": 463,
        "group": "chbe"
    },
    {
        "name": "CHBE 244",
        "title": "Chemical and Biological Engineering Thermodynamics I",
        "credits": 3,
        "desc": "Energy and the first law; second law of thermodynamics; entropy; availability (energy) analysis; thermodynamic properties of fluids, application to power generation, refrigeration, and liquefaction, as well as biological, environmental, and electrochemical systems. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: CHBE 241.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 342,
        "y": 469,
        "group": "chbe"
    },
    {
        "name": "CHBE 251",
        "title": "Transport Phenomena I",
        "credits": 3,
        "desc": "Fluid Mechanics. Momentum-transfer in fluids in laminar and turbulent flow; microscopic and macroscopic material; momentum and energy balances; rheology; dimensional analysis; flow in conduits; pumps; fluid metering. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: PHYS 170.\nCorequisite: MATH 256.\n",
        "coreqs": [
            "MATH 256"
        ],
        "prereqs": [
            "MATH 256"
        ],
        "postreqs": [],
        "x": 340,
        "y": 475,
        "group": "chbe"
    },
    {
        "name": "CHBE 262",
        "title": "Chemical Engineering and Applied Chemistry Laboratory",
        "credits": 4,
        "desc": "Experiments chosen to illustrate and use material presented in 200-level CHBE and CHEM courses. This course is not eligible for Credit/D/Fail grading. [0-4-0; 0-4-0]\nCorequisite: All of CHBE 201, CHBE 241, CHBE 251, CHEM 250, CHEM 251, CHEM 260.\n",
        "coreqs": [
            "CHBE 201",
            "CHBE 241",
            "CHBE 251"
        ],
        "prereqs": [],
        "postreqs": [],
        "x": 337,
        "y": 481,
        "group": "chbe"
    },
    {
        "name": "CHBE 263",
        "title": "Introduction to Chemical and Biological Engineering Laboratory Practice",
        "credits": 1,
        "desc": "Introduction to Chemical and Biological Engineering laboratory practice with topics in physical, inorganic and organic chemistry. This course is not eligible for Credit/D/Fail grading. [0-2-0]\nCorequisite: All of CHBE 220, CHBE 241, CHEM 250, CHEM 260.\n",
        "coreqs": [
            "CHBE 220",
            "CHBE 241"
        ],
        "prereqs": [],
        "postreqs": [],
        "x": 334,
        "y": 486,
        "group": "chbe"
    },
    {
        "name": "CHBE 264",
        "title": "Chemical and Biological Engineering Laboratory",
        "credits": 3,
        "desc": "Laboratory experiment in 2nd year Chemical and Biological Engineering This course is not eligible for Credit/D/Fail grading. [1-4-0]\nPrerequisite: CHBE 263.\nCorequisite: All of CHBE 244, CHBE 251.\n",
        "coreqs": [
            "CHBE 244",
            "CHBE 251"
        ],
        "prereqs": [
            "CHBE 244",
            "CHBE 251"
        ],
        "postreqs": [],
        "x": 330,
        "y": 491,
        "group": "chbe"
    },
    {
        "name": "CHBE 344",
        "title": "Introduction to Unit Operations",
        "credits": 3,
        "desc": "Foundational concepts and design equations for basic unit operations such as: comminution, screening, filtration, centrifugal separations, evaporation and crystallization. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 241, CHBE 244.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 327,
        "y": 496,
        "group": "chbe"
    },
    {
        "name": "CHBE 345",
        "title": "Unit Operations",
        "credits": 4,
        "desc": "Stage-wise mass transfer operations; extraction and absorption; single and stage-wise binary and multi-component distillation; principles and equipment design for continuous contact mass transfer operations including absorption, binary distillation and others such as extraction, drying, and humidification. This course is not eligible for Credit/D/Fail grading. [4-0-2*]\nPrerequisite: All of CHBE 346, CHBE 352.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 322,
        "y": 501,
        "group": "chbe"
    },
    {
        "name": "CHBE 346",
        "title": "Chemical and Biological Engineering Thermodynamics II",
        "credits": 3,
        "desc": "Volumetric and thermodynamic properties of fluids; equations of state; heat effects; ideal and non-ideal mixtures; fugacities and activity coefficients; vapor-liquid and liquid-liquid phase equilibrium; solubility of gases and solids in liquids; chemical reaction equilibrium; equilibrium partitioning of pollutants. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 220, CHBE 241, CHBE 244.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 318,
        "y": 505,
        "group": "chbe"
    },
    {
        "name": "CHBE 350",
        "title": "Mass Transfer Bridge Module",
        "credits": 1,
        "desc": "Mass transfer; molecular diffusion; convective transfer; analogies among heat, mass and momentum transfer; mass transfer coefficients; interphase mass transfer. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: All of CHBE 251, CHBE 351, MATH 253.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 313,
        "y": 510,
        "group": "chbe"
    },
    {
        "name": "CHBE 352",
        "title": "Transport Phenomena II",
        "credits": 4,
        "desc": "Heat and mass transfer; conduction and molecular diffusion; convective transfer; analogies among heat, mass and momentum transfer; heat exchanger design; mass transfer coefficients; interphase mass transfer. This course is not eligible for Credit/D/Fail grading. [4-0-2*]\nPrerequisite: All of CHBE 251, MATH 253.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 308,
        "y": 513,
        "group": "chbe"
    },
    {
        "name": "CHBE 355",
        "title": "Kinetics and Reactor Design",
        "credits": 3,
        "desc": "Kinetics of homogeneous chemical and biological reactions, isothermal ideal reactor design, analysis of non-ideal reactors using residence time distribution and mixing models. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: All of CHBE 230, CHBE 346, CHBE 352.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 303,
        "y": 517,
        "group": "chbe"
    },
    {
        "name": "CHBE 356",
        "title": "Process Dynamics and Control",
        "credits": 4,
        "desc": "Introduction to modelling of chemical processes; transient response analysis; design of feedback control systems; stability analysis; frequency response analysis; process control applications; instrumentation; advanced control techniques; distributed control systems. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: One of MATH 255, MATH 256.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 298,
        "y": 520,
        "group": "chbe"
    },
    {
        "name": "CHBE 362",
        "title": "Process Engineering Laboratory",
        "credits": 3,
        "desc": "Experiments to illustrate and use material presented in 200 and 300-level CHBE courses. Field trips may be required. This course is not eligible for Credit/D/Fail grading. [1-4-0]\nPrerequisite: All of CHBE 201, CHBE 241, CHBE 251, CHBE 264.\nCorequisite: All of CHBE 370, CHBE 352.\n",
        "coreqs": [
            "CHBE 370",
            "CHBE 352"
        ],
        "prereqs": [
            "CHBE 370",
            "CHBE 352"
        ],
        "postreqs": [],
        "x": 292,
        "y": 523,
        "group": "chbe"
    },
    {
        "name": "CHBE 364",
        "title": "Environmental Engineering Laboratory",
        "credits": 3,
        "desc": "Laboratory experiments to illustrate key concepts and measurement techniques in environmental engineering as used by  engineers. This course is not eligible for Credit/D/Fail grading. [1-4-0]\nCorequisite: CHBE 373.\n",
        "coreqs": [
            "CHBE 373"
        ],
        "prereqs": [],
        "postreqs": [],
        "x": 286,
        "y": 525,
        "group": "chbe"
    },
    {
        "name": "CHBE 365",
        "title": "Biological Engineering  Laboratory",
        "credits": 3,
        "desc": "Laboratory experiments to illustrate key concepts and measurement techniques in biotechnology as used by engineers. Field trips may be required. This course is not eligible for Credit/D/Fail grading. [1-4-0]\nPrerequisite: All of CHBE 201, CHBE 241, CHBE 264, CHBE 221.\nCorequisite: CHBE 381.\n",
        "coreqs": [
            "CHBE 381"
        ],
        "prereqs": [
            "CHBE 381"
        ],
        "postreqs": [],
        "x": 280,
        "y": 528,
        "group": "chbe"
    },
    {
        "name": "CHBE 366",
        "title": "Chemical Engineering Laboratory",
        "credits": 3,
        "desc": "Experiments to illustrate and use material presented in 300-level Chemical Engineering program courses. Field trips may be required. This course is not eligible for Credit/D/Fail grading. [1-4-0]\nPrerequisite: All of CHBE 201, CHBE 241, CHBE 251, CHBE 264.\nCorequisite: All of CHBE 345, CHBE 356.\n",
        "coreqs": [
            "CHBE 345",
            "CHBE 356"
        ],
        "prereqs": [
            "CHBE 345",
            "CHBE 356"
        ],
        "postreqs": [],
        "x": 274,
        "y": 529,
        "group": "chbe"
    },
    {
        "name": "CHBE 370",
        "title": "Fundamentals of Sustainable Engineering",
        "credits": 3,
        "desc": "Introduction to sustainable practice for Chemical and Biological Engineers.  Pollution prevention, cleaner production, green chemistry and engineering, and sustainable design; environmental impact assessment including life-cycle assessment, total cost analysis and environmental systems analysis; applications in chemical and biological process industries. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 241, CHBE 244.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 268,
        "y": 531,
        "group": "chbe"
    },
    {
        "name": "CHBE 373",
        "title": "Water Pollution Control",
        "credits": 4,
        "desc": "Legal, environmental and physicochemical aspects of industrial water pollution and its abatement will be surveyed; techniques for design of wastewater treatment processes currently used in industry; case studies from chemical and process industries will be considered in detail. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: One of CHBE 251, CIVL 215, MECH 280, MTRL 263.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 262,
        "y": 532,
        "group": "chbe"
    },
    {
        "name": "CHBE 376",
        "title": "Computer Flowsheeting and Unit Operation Design",
        "credits": 4,
        "desc": "Theory and practice of computer flowsheeting in chemical plant design; hands-on use of modern process simulators, prediction of thermodynamic properties of fluids; behaviour of single and multiphase systems. Design of unit operations. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: CHBE 241.\nCorequisite: All of CHBE 345, CHBE 355.\n",
        "coreqs": [
            "CHBE 345",
            "CHBE 355"
        ],
        "prereqs": [
            "CHBE 345",
            "CHBE 355"
        ],
        "postreqs": [],
        "x": 256,
        "y": 532,
        "group": "chbe"
    },
    {
        "name": "CHBE 381",
        "title": "Bioprocess Engineering I",
        "credits": 3,
        "desc": "Biological process engineering in the fields of biotechnology and biomedical engineering; enzymatic and cellular kinetics; cell culture, process development and product recovery; bioreactor design and operation. Credit will be granted for only one of CHBE 381, CHBE 560. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: One of CHBE 221, BMEG 245 and one of MATH 101, MATH 103, MATH 105. Third or fourth year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 250,
        "y": 533,
        "group": "chbe"
    },
    {
        "name": "CHBE 401",
        "title": "Mechanical Pulping and Papermaking",
        "credits": 3,
        "desc": "Process and unit operations in mechanical pulping and papermaking, emphasizing principles and practice of refining, screening, cleaning, papermaking and properties of paper products, key economic and environmental issues. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 243,
        "y": 532,
        "group": "chbe"
    },
    {
        "name": "CHBE 402",
        "title": "Biomass Fractionation Technology",
        "credits": 3,
        "desc": "Process and unit operations in the conversion of wood chips to pulp and green bio-products. Biorefinery concepts and emerging technologies for the production of biomaterials, biochemicals and bioenergy. Credit will be granted for only one of CHBE 402, CHBE 502. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 237,
        "y": 532,
        "group": "chbe"
    },
    {
        "name": "CHBE 419",
        "title": "Industrial Biotechnology Laboratory",
        "credits": 3,
        "desc": "Modern bioreactor technology, upstream and downstream processing of biotechnology products. Restricted to students in the Joint Degree in Biotechnology. [1-4-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 231,
        "y": 531,
        "group": "chbe"
    },
    {
        "name": "CHBE 451",
        "title": "Engineering Thermodynamics and Statistical Mechanics",
        "credits": 3,
        "desc": "Classical thermodynamic relations from a molecular perspective. Pressure-volume-temperature relations; chemical equilibria by Gibbs' method; vapor-liquid equilibria; thermodynamic calculations based on macroscopic and statistical methods; nonequilibrium processes; molecular simulations. Credit will be granted for only one of CHBE 451, CHBE 551. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: One of CHBE 346, MTRL 350. Or equivalent.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 225,
        "y": 529,
        "group": "chbe"
    },
    {
        "name": "CHBE 452",
        "title": "Environmental Process Design Project",
        "credits": 6,
        "desc": "8-month project-based course, concepts from chemical, biological, and environmental science engineering with economics, life cycle analysis and health and safety considerations to solve problems related to the protection of the environment. [2-0-8]\nPrerequisite: All of BIOL 112, CHBE 241, CHBE 254, CHBE 344, CHBE 346, CHBE 351, CHBE 356, CHBE 373.\nCorequisite: All of CHBE 457, CHBE 459, CHBE 485.\n",
        "coreqs": [
            "CHBE 457",
            "CHBE 459",
            "CHBE 485"
        ],
        "prereqs": [
            "CHBE 457",
            "CHBE 459",
            "CHBE 485"
        ],
        "postreqs": [],
        "x": 219,
        "y": 528,
        "group": "chbe"
    },
    {
        "name": "CHBE 453",
        "title": "Biological Process and Product Design",
        "credits": 8,
        "desc": "8-month project-based course, integrating chemical and biological engineering concepts with economics, life cycle analysis and health and safety considerations in the design of major biological processes. This course is not eligible for Credit/D/Fail grading. [2-0-4; 2-0-4]\nPrerequisite: All of CHBE 241, CHBE 345, CHBE 356, CHBE 376, CHBE 381.\nCorequisite: All of CHBE 459, CHBE 481.\n",
        "coreqs": [
            "CHBE 459",
            "CHBE 481"
        ],
        "prereqs": [
            "CHBE 459",
            "CHBE 481"
        ],
        "postreqs": [],
        "x": 213,
        "y": 525,
        "group": "chbe"
    },
    {
        "name": "CHBE 454",
        "title": "Chemical Process and Product Design",
        "credits": 8,
        "desc": "8-month project-based course, integrating chemical engineering concepts with economics, life cycle analysis and health and safety considerations in the design of major chemical processes. This course is not eligible for Credit/D/Fail grading. [2-0-4; 2-0-4]\nPrerequisite: All of CHBE 241, CHBE 345, CHBE 356, CHBE 376.\nCorequisite: All of CHBE 459, CHBE 471.\n",
        "coreqs": [
            "CHBE 459",
            "CHBE 471"
        ],
        "prereqs": [
            "CHBE 459",
            "CHBE 471"
        ],
        "postreqs": [],
        "x": 207,
        "y": 523,
        "group": "chbe"
    },
    {
        "name": "CHBE 455",
        "title": "Kinetics and Reactor Design",
        "credits": 3,
        "desc": "Kinetics of homogeneous chemical and biological reactions, isothermal ideal reactor design, analysis of non-ideal reactors using residence time distribution and mixing models. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: CHEM 251.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 201,
        "y": 520,
        "group": "chbe"
    },
    {
        "name": "CHBE 456",
        "title": "Heterogenous Catalysis and Advanced Reactor Design",
        "credits": 3,
        "desc": "Definition of heterogeneous catalysis; properties of catalysts; kinetics of catalytic reactions; ideal heterogeneous reactors; non-isothermal reactor design; mass and heat transfer effects in heterogeneous reactors; examples of industrial reactors. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 230, CHBE 352, CHBE 355.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 196,
        "y": 517,
        "group": "chbe"
    },
    {
        "name": "CHBE 457",
        "title": "Process Synthesis",
        "credits": 3,
        "desc": "Strategy for the conceptual design of industrial chemical and biological processes; rules of thumb for chemical engineers, simulation to assist process synthesis, reactor-separator network synthesis, introduction to product design and molecular structure design, efficiency and sustainability in the chemical industry. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 241, CHBE 346, CHBE 376, CHBE 344.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 191,
        "y": 513,
        "group": "chbe"
    },
    {
        "name": "CHBE 459",
        "title": "Chemical and Biological Engineering Economics",
        "credits": 3,
        "desc": "Estimation of capital and operating costs; interest calculations; taxes; economic comparison of alternatives; economic optimization. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 186,
        "y": 510,
        "group": "chbe"
    },
    {
        "name": "CHBE 464",
        "title": "Chemical and Biological Engineering Laboratory",
        "credits": 4,
        "desc": "Experiments in unit operations relating to process, environmental and biological engineering. Experiments are designed to provide experience in instrumentation and control. Field trips may be required. This course is not eligible for Credit/D/Fail grading. [0-6-0; 0-6-0]\nPrerequisite: All of CHBE 345, CHBE 355, CHBE 356, CHBE 362 and one of CHBE 365, CHBE 366.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 181,
        "y": 505,
        "group": "chbe"
    },
    {
        "name": "CHBE 465",
        "title": "Rehabilitation and Design of Aquatic Habitat",
        "credits": 3,
        "desc": "Modelling the effects of the environment and nutrient availability on growth and waste production; designing closed and open environments for aquatic organisms; developing prescriptions for habitat rehabilitation. This course is not eligible for Credit/D/Fail grading. [2-2*-2*]\nPrerequisite: CHBE 221 or equivalent and third-year standing required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 177,
        "y": 501,
        "group": "chbe"
    },
    {
        "name": "CHBE 470",
        "title": "Transport in Biological Systems",
        "credits": 3,
        "desc": "Mass transport and fluid flow, including physiological tissues and tissue constructs. Mass transport deficiencies that lead to the development of pathological tissue and drug delivery to these tissues. Biological engineering for the design of tissue constructs and artificial organs. Credit will be granted for only one of CHBE 470, CHBE 570, BMEG 371. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: One of CHBE 221, BMEG 245.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 172,
        "y": 496,
        "group": "chbe"
    },
    {
        "name": "CHBE 471",
        "title": "Chemical Process Engineering",
        "credits": 4,
        "desc": "Selection and design of major equipment used in chemical process plants, including heat exchangers, separators, reactors. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: All of CHBE 345, CHBE 352, CHBE 355, CHBE 376.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 169,
        "y": 491,
        "group": "chbe"
    },
    {
        "name": "CHBE 474",
        "title": "Process Control Engineering",
        "credits": 3,
        "desc": "Frequency response analysis; advanced control techniques; multivariable control systems; mathematical tools for computer control systems; design of computer control systems; engineering design of industrial control applications; plant wide control concepts; distributed control systems concepts. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\nPrerequisite: All of CHBE 356, CHBE 376.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 165,
        "y": 486,
        "group": "chbe"
    },
    {
        "name": "CHBE 476",
        "title": "Modelling and Optimization in Chemical Engineering",
        "credits": 3,
        "desc": "Mathematical modelling of chemical plants and processes; computer simulation; introduction to numerical optimization techniques. This course is not eligible for Credit/D/Fail grading. [3-2*-0]\nPrerequisite: All of CHBE 344, CHBE 376.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 162,
        "y": 481,
        "group": "chbe"
    },
    {
        "name": "CHBE 477",
        "title": "Fuel Cell and Electrochemical Engineering",
        "credits": 3,
        "desc": "Stoichiometry, thermodynamics and kinetics of electrode reactions; conductivity and mass transport in electrolytes; material, energy and voltage balances; design of  electrosynthesis, electrorecovery of metals, and energy generation of batteries and fuel cells. Credit will be granted for only one of CHBE 477, CHBE 577. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: All of CHBE 220, CHBE 241, CHBE 346.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 159,
        "y": 475,
        "group": "chbe"
    },
    {
        "name": "CHBE 478",
        "title": "Polymer Science and Processing",
        "credits": 3,
        "desc": "Introduction to polymer chemistry, polymer properties, polymer processing and technological applications This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of CHEM 260, CHBE 251 or equivalent\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 157,
        "y": 469,
        "group": "chbe"
    },
    {
        "name": "CHBE 479",
        "title": "Chemical Engineering Aspects of Occupational Health and Safety",
        "credits": 3,
        "desc": "Relationship between current engineering practice and worker health and safety. Engineering analysis of industrial health and safety problems. This course is not eligible for Credit/D/Fail grading. [2-2-0]\nPrerequisite: Third-year Chemical and Biological Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 154,
        "y": 463,
        "group": "chbe"
    },
    {
        "name": "CHBE 480",
        "title": "Hazardous Waste Processing Technology",
        "credits": 3,
        "desc": "Characterization, treatment and final disposal of hazardous waste with emphasis upon chemical engineering principles. Topics to include relevant legislation, in-plant minimization, treatment options and clean-up of contaminated sites. Case studies to be used for illustration. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Third year Chemical and Biological Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 153,
        "y": 457,
        "group": "chbe"
    },
    {
        "name": "CHBE 481",
        "title": "Bioprocess Engineering II",
        "credits": 4,
        "desc": "Bioprocess flowsheeting; production-scale fermenter design; product recovery and purification; bioseparations; chromatography; viral inactivation and removal; process validation. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: CHBE 381.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 151,
        "y": 451,
        "group": "chbe"
    },
    {
        "name": "CHBE 482",
        "title": "Petroleum Refining Process Modelling and Simulation",
        "credits": 3,
        "desc": "Petroleum feed stocks testing methods, pseudocomponents, and property methods. Design and simulation of separation and reaction systems. Steady state and dynamic simulation. This course is not eligible for Credit/D/Fail grading. [3-1-0]\nPrerequisite: All of CHBE 345, CHBE 355, CHBE 376.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 150,
        "y": 445,
        "group": "chbe"
    },
    {
        "name": "CHBE 483",
        "title": "Energy Engineering",
        "credits": 3,
        "desc": "Supply and use of conventional and alternative fuels and energy.  Design and operation of unit operations for processing of fossil fuels, biomass, and other energy sources.  Environmental considerations of energy use. Credit will be granted for only one of CHBE 483, CHBE 583. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Third-year Chemical and Biological Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 150,
        "y": 439,
        "group": "chbe"
    },
    {
        "name": "CHBE 484",
        "title": "Green Engineering Principles and Applications for Process Industries",
        "credits": 3,
        "desc": "Pollution prevention, cleaner production, green chemistry and engineering, industrial ecology, eco-industrial parks, and sustainable development; environmental impact assessment including life-cycle assessment, total cost analysis and environmental systems analysis; reduce/recycling/reuse of wastes and by-products. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: All of CHBE 241, CHBE 244.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 150,
        "y": 433,
        "group": "chbe"
    },
    {
        "name": "CHBE 485",
        "title": "Air Pollution Prevention and Control",
        "credits": 3,
        "desc": "Impacts of air pollutants on health, visibility, smog formation, ozone depletion and global warming; air quality and emission standards; atmospheric dispersion of air pollutants; prevention and control technologies for particulates, SOx, NOx, VOCs, and CO2. Credit will be granted for only one of CHBE 485, CHBE 575. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 150,
        "y": 426,
        "group": "chbe"
    },
    {
        "name": "CHBE 486",
        "title": "Waste Management for Resource Recovery",
        "credits": 3,
        "desc": "Physico-chemical, thermal, and biological methods for purification of solid waste and wastewater, and conversion to bioproducts/industrial products, energy and clean water. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: All of CHBE 241, CHBE 244, CHBE 370.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 150,
        "y": 420,
        "group": "chbe"
    },
    {
        "name": "CHBE 487",
        "title": "Interfacial Phenomena",
        "credits": 3,
        "desc": "Outline of the physics and chemistry of interfaces; discussion of the part played by surface effects in technical processes. Credit will be granted for only one of CHBE 357, CHBE 487, CHBE 587. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of CHBE 241, FNH  300.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 151,
        "y": 414,
        "group": "chbe"
    },
    {
        "name": "CHBE 488",
        "title": "Carbon Capture, Conversion and Sequestration Technologies",
        "credits": 3,
        "desc": "Examination of carbon capture technologies, and CO2 conversion and sequestration options. Technical foundations on carbon cycle, thermodynamics, transport, absorption, adsorption, sequestration, mineralization and conversion. Analysis of cases in the context of technology, policy and regulatory framework. Credit will be granted for only one of CHBE 488 or CHBE 588. This course is not eligible for Credit/D/Fail grading. [3-0-1]\nPrerequisite: One of CHBE 244, MTRL 252 and one of CHBE 251, CIVL 215, MTRL 263.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 153,
        "y": 408,
        "group": "chbe"
    },
    {
        "name": "CHBE 489",
        "title": "Pollution Control in the Pulp and Paper Industry",
        "credits": 3,
        "desc": "Pollutants of concern in the pulp and paper industry; environmental impact of the industry; technologies used for the control of solid, liquid and gaseous wastes. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 154,
        "y": 402,
        "group": "chbe"
    },
    {
        "name": "CHBE 491",
        "title": "Thesis Proposal",
        "credits": 1,
        "desc": "Literature searching, planning, equipment design, experimental design for an individual research project leading to a written proposal and oral presentation. This course is not eligible for Credit/D/Fail grading. [0-2-0]\nPrerequisite: All of CHBE 362, CHBE 366.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 157,
        "y": 396,
        "group": "chbe"
    },
    {
        "name": "CHBE 492",
        "title": "Thesis",
        "credits": 5,
        "desc": "Research project under the direction of a staff member. This course is not eligible for Credit/D/Fail grading. [0-8-0]\nPrerequisite: CHBE 491.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 159,
        "y": 390,
        "group": "chbe"
    },
    {
        "name": "CHBE 493",
        "title": "Thesis Proposal-Environmental Topic",
        "credits": 1,
        "desc": "Literature search, planning, equipment design for an individual research project leading to a written proposal and oral presentation. Topic to be chosen from a selection of environmental topics offered by the department. This course is not eligible for Credit/D/Fail grading. [0-2-0]\nPrerequisite: All of CHBE 362, CHBE 364.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 162,
        "y": 384,
        "group": "chbe"
    },
    {
        "name": "CHBE 494",
        "title": "Thesis-Environmental Topic",
        "credits": 5,
        "desc": "Environmental engineering research topic. This course is not eligible for Credit/D/Fail grading. [0-8-0]\nPrerequisite: CHBE 493.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 165,
        "y": 379,
        "group": "chbe"
    },
    {
        "name": "CHBE 495",
        "title": "Thesis Proposal-Biotechnology Topic",
        "credits": 1,
        "desc": "Literature search, planning, equipment design for an individual research project leading to a written proposal and oral presentation. Topic to be chosen from a selection of biotechnology topics offered by the department. This course is not eligible for Credit/D/Fail grading. [0-2-0]\nPrerequisite: All of CHBE 362, CHBE 365.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 169,
        "y": 374,
        "group": "chbe"
    },
    {
        "name": "CHBE 496",
        "title": "Thesis Biotechnology Topic",
        "credits": 5,
        "desc": "Biotechnological engineering research topic. This course is not eligible for Credit/D/Fail grading. [0-8-0]\nPrerequisite: CHBE 495.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 172,
        "y": 369,
        "group": "chbe"
    },
    {
        "name": "CHBE 497",
        "title": "Topics in Chemical and Biological Engineering",
        "credits": 1,
        "desc": "Seminar or lecture. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 177,
        "y": 364,
        "group": "chbe"
    },
    {
        "name": "CHBE 498",
        "title": "Engineering Report",
        "credits": 1,
        "desc": "This should be written on some subject of scientific interest or technical interest, based preferably on personal experience. Specifications are issued by the Department. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: Third-year Chemical and Biological Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 181,
        "y": 360,
        "group": "chbe"
    },
    {
        "name": "CHBE 502",
        "title": "Biomass Fractionation Chemistry",
        "credits": 3,
        "desc": "Extraction of soluble compounds and macromolecules. Chemical and technical processes in production of pulp. Bleaching. Fiber production from woody and herbaceous biomass. Production of reactive intermediates. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 186,
        "y": 355,
        "group": "chbe"
    },
    {
        "name": "CHBE 505",
        "title": "Introduction to Chemical Engineering for Non-Chemical Engineers",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\nPrerequisite: Supervisor and instructor approval required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 191,
        "y": 352,
        "group": "chbe"
    },
    {
        "name": "CHBE 506",
        "title": "Industrial Process Engineering",
        "credits": 3,
        "desc": "Mass and energy balances. Stoichiometry. Flow diagrams. Key unit operations for selected process industries in Western Canada with special attention to emission controls and hazards. May require field trips. Not open to Chemical and Biological Engineering students. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 196,
        "y": 348,
        "group": "chbe"
    },
    {
        "name": "CHBE 510",
        "title": "Optimization of Bioprocesses",
        "credits": 3,
        "desc": "Experimental design, data analysis, model building, reactor dynamics and computer control for optimization. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 201,
        "y": 345,
        "group": "chbe"
    },
    {
        "name": "CHBE 549",
        "title": "Master's Thesis for M.Sc",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 207,
        "y": 342,
        "group": "chbe"
    },
    {
        "name": "CHBE 550",
        "title": "Advanced Reactor Design",
        "credits": 3,
        "desc": "Topics vary from year to year, and may include kinetics of fluid-solid reactions of single particles, packed, moving, fluidized and transported bed reactors; rotary kilns; gas-liquid reaction kinetics and reactor design; reactor design for gas-liquid-solid and non-catalytic processes. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 213,
        "y": 340,
        "group": "chbe"
    },
    {
        "name": "CHBE 551",
        "title": "Engineering Thermodynamics and Statistical Mechanics",
        "credits": 3,
        "desc": "Classical thermodynamic relations from a molecular perspective. Pressure-volume- temperature relations; chemical equilibria by Gibbs' method; vapor-liquid equilibria; thermodynamic calculations based on macroscopic and statistical methods; nonequilibrium processes; molecular simulations. Credit will be granted for only one of CHBE 451, CHBE 551. This course is not eligible for Credit/D/Fail grading. [3-0-2*]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 219,
        "y": 337,
        "group": "chbe"
    },
    {
        "name": "CHBE 552",
        "title": "Optimization Methods",
        "credits": 3,
        "desc": "Basic concepts of optimization and structure of mathematical models. Gradient methods. Direct search methods. Gauss-Newton method for parameter optimization in models described by ordinary and partial differential equations. Constrained optimization. Statistical inferences. Design of experiments. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 225,
        "y": 336,
        "group": "chbe"
    },
    {
        "name": "CHBE 553",
        "title": "Mathematical Operations in Chemical Engineering",
        "credits": 3,
        "desc": "Topics vary from year to year. Amongst these will be dimensional analysis and model theory; treatment and interpretation of chemical engineering data; formulation and solution of differential and finite difference equations; graphical, numerical and statistical methods. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 231,
        "y": 334,
        "group": "chbe"
    },
    {
        "name": "CHBE 554",
        "title": "Momentum, Heat and Mass Transfer",
        "credits": 3,
        "desc": "Prediction of velocity, temperature, and concentration profiles for flowing fluids; unifying concepts and analogies in momentum, heat, and mass transport; streamline flow and turbulence, molecular and eddy conduction and diffusion, boundary layers, smooth and rough conduits and other boundaries. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 237,
        "y": 333,
        "group": "chbe"
    },
    {
        "name": "CHBE 557",
        "title": "Fluid Dynamics",
        "credits": 3,
        "desc": "Topics vary from year to year and include: governing equations for Newtonian fluids; numerical solutions to Navier-Stokes equations; incompressible boundary layers; stability analysis;  turbulence; applied Computational Fluid Dynamics (CFD); modelling multi-phase fluids by Eulerian and Lagrangian methods; commercial CFD software. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 243,
        "y": 333,
        "group": "chbe"
    },
    {
        "name": "CHBE 559",
        "title": "Topics in Chemical Engineering",
        "credits": 3,
        "desc": "A discussion of some aspects of modern Chemical Engineering. Subject matter varies each year. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 250,
        "y": 333,
        "group": "chbe"
    },
    {
        "name": "CHBE 560",
        "title": "Biological Engineering",
        "credits": 3,
        "desc": "Biological process engineering in the fields of biotechnology and biomedical engineering; enzymatic and cellular kinetics; cell culture, bioreactor mass transport and process development. Critical analysis of recent biological engineering research articles. Credit will be granted for only one of CHBE 381 or CHBE 560. This course is not eligible for Credit/D/Fail grading. [3-0-2]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 256,
        "y": 333,
        "group": "chbe"
    },
    {
        "name": "CHBE 561",
        "title": "Particle Technology",
        "credits": 3,
        "desc": "Topics vary from year to year and include gas, liquid, and particle mechanics, fine and nano particles; colloidal phenomena; packed beds; filtration; sedimentation; two- and three-phase fluidized beds; spouted beds; hydraulic and pneumatic transport; multiphase flows. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 262,
        "y": 333,
        "group": "chbe"
    },
    {
        "name": "CHBE 563",
        "title": "Applied Heterogeneous Catalysis",
        "credits": 3,
        "desc": "Techniques for characterizing catalysts and their surfaces. Commercial methods of preparing catalysts. Chemistry of catalytic reactions and the impact of catalyst properties, mechanisms and kinetics on reactor engineering. Applications of catalytic oxidations, hydrogenations, C-C bond formation and cracking. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 268,
        "y": 334,
        "group": "chbe"
    },
    {
        "name": "CHBE 564",
        "title": "Industrial Biotechnology Laboratory",
        "credits": 3,
        "desc": "Modern bioreactor technology, upstream and downstream processing of biotechnology products. Credit will be granted for only one of CHBE 564 or MICB 419. This course is not eligible for Credit/D/Fail grading. [1-4-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 274,
        "y": 336,
        "group": "chbe"
    },
    {
        "name": "CHBE 565",
        "title": "Advanced Process Control",
        "credits": 3,
        "desc": "Discrete-time chemical system modelling; model-based predictive control; predictive controller design; analysis of design parameters; controller stability; robustness and performance analysis; selected topics from current developments in the literature. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 280,
        "y": 337,
        "group": "chbe"
    },
    {
        "name": "CHBE 566",
        "title": "Topics in Biological Engineering",
        "credits": 3,
        "desc": "Critical analysis of biological engineering research articles and literature review in an area of focus. Topics chosen from: bioprocess, biosensor, biotechnology, and biomedical engineering. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: BIOL 112.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 286,
        "y": 340,
        "group": "chbe"
    },
    {
        "name": "CHBE 567",
        "title": "System Identification and Adaptive Control",
        "credits": 3,
        "desc": "Input/Output modelling; frequency analysis; regression analysis; model parametrizations; recursive estimation methods; model validation; adaptive controller design; implementation issues; chemical process control applications; selected topics from current developments in the literature. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 292,
        "y": 342,
        "group": "chbe"
    },
    {
        "name": "CHBE 570",
        "title": "Advanced Transport in Biological Systems",
        "credits": 3,
        "desc": "Advanced studies in mass transport: material flow in biological systems from cellular to whole body level under normal and pathological conditions. Biological engineering approaches for designing tissue constructs and artificial organs. Credit will be granted for only one of CHBE 470, CHBE 570, or BMEG 371. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: BIOL 112.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 298,
        "y": 345,
        "group": "chbe"
    },
    {
        "name": "CHBE 571",
        "title": "Non-Newtonian Fluid Behaviour",
        "credits": 3,
        "desc": "Selections from the following topics: kinematics of deformation and flow, dynamics of continuous media, constitutive equations, physical chemical and molecular aspects of viscosity, engineering applications to pipe flow, mixing, heat transfer. Handling of suspensions and polymers. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 303,
        "y": 348,
        "group": "chbe"
    },
    {
        "name": "CHBE 573",
        "title": "Engineering and Sustainability Leadership",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 308,
        "y": 352,
        "group": "chbe"
    },
    {
        "name": "CHBE 574",
        "title": "Equilibrium Properties of Non-Ideal Mixtures",
        "credits": 3,
        "desc": "Discussion of various methods of calculating vapor-liquid, liquid-liquid equilibrium and thermal properties, including molecular thermodynamics. Excess free-energy of mixing. Thermodynamic consistency tests. Emphasis on engineering applications and newer approaches. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 313,
        "y": 355,
        "group": "chbe"
    },
    {
        "name": "CHBE 575",
        "title": "Air Pollution Control",
        "credits": 3,
        "desc": "Characteristics of various air pollutants, their behaviour in the atmosphere, monitoring problems, technology of particle collection and control of pollutant gases. Particular problems of regional interest are discussed. Credit will be granted for only one of CHBE 485 or CHBE 575. This course is not eligible for Credit/D/Fail grading. \nEquivalency: CHBE 485.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 318,
        "y": 360,
        "group": "chbe"
    },
    {
        "name": "CHBE 577",
        "title": "Electrochemical Science, Engineering and Technology",
        "credits": 3,
        "desc": "Electrochemical interfaces; electrode reactions; thermodynamics; kinetics and transport processes in electrochemical systems; experimental techniques. Electrochemical reactors and processes; modelling, design and economics. Electrochemical technologies; electrosynthesis, batteries and fuel cells. Electro-metallurgy; electrowinning and refining of metals, corrosion, leaching and cementation. Credit will be granted for only one of CHBE 477 or CHBE 577. This course is not eligible for Credit/D/Fail grading. \nEquivalency: CHBE 477.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 322,
        "y": 364,
        "group": "chbe"
    },
    {
        "name": "CHBE 580",
        "title": "Advanced Topics in Pulp and Paper Engineering",
        "credits": 3,
        "desc": "Advanced material in selected topics in pulp and paper in science and engineering.  Subject matter varies each year. This course is not eligible for Credit/D/Fail grading. [3-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 327,
        "y": 369,
        "group": "chbe"
    },
    {
        "name": "CHBE 583",
        "title": "Energy Engineering",
        "credits": 3,
        "desc": "Supply and use of conventional and alternative fuels and energy. Design and operation of unit operations for processing of fossil fuels, biomass, and other energy sources. Environmental considerations of energy use. Credit will be granted for only one of CHBE 483 or CHBE 583. This course is not eligible for Credit/D/Fail grading. \nEquivalency: CHBE 483.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 330,
        "y": 374,
        "group": "chbe"
    },
    {
        "name": "CHBE 587",
        "title": "Interfacial Phenomena",
        "credits": 3,
        "desc": "Outline of the physics and chemistry of interfaces; discussion of the part played by surface effects in technical processes. Credit will be granted for only one of CHBE 357, CHBE 487, CHBE 587. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: MATH 255 (or equivalent); PHYS 108, PHYS 118, PHYS 158 (or equivalent); CHEM 154 (or equivalent).\nEquivalency: FOOD 519.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 334,
        "y": 379,
        "group": "chbe"
    },
    {
        "name": "CHBE 588",
        "title": "Carbon Capture, Conversion and Sequestration Technologies",
        "credits": 3,
        "desc": "Credit will be granted for only one of CHBE 488 or CHBE 588. This course is not eligible for Credit/D/Fail grading. [3-0-1]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 337,
        "y": 384,
        "group": "chbe"
    },
    {
        "name": "CHBE 590",
        "title": "Small Watershed Systems Design",
        "credits": 3,
        "desc": "Hydrologic design of water management systems for the production of agricultural and other biological materials. Analysis and design of composite systems for watersheds. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 340,
        "y": 390,
        "group": "chbe"
    },
    {
        "name": "CHBE 596",
        "title": "Engineering Report",
        "credits": 6,
        "desc": "For M.Eng. students. Carry out a literature review, conduct a research or design project and prepare an engineering report under the supervision of a faculty member. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 342,
        "y": 396,
        "group": "chbe"
    },
    {
        "name": "CHBE 597",
        "title": "M.A.Sc. Thesis Proposal Development",
        "credits": 2,
        "desc": "Techniques for preparation of a critical literature review and focussed research proposal for M.A.Sc. candidates. Students perform oral and written critiques of published research in their area of study, define research questions and hypotheses, and develop a focussed research proposal. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 345,
        "y": 402,
        "group": "chbe"
    },
    {
        "name": "CHBE 598",
        "title": "Master's Seminar",
        "credits": 1,
        "desc": "Current topics in chemical and biological engineering research. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 346,
        "y": 408,
        "group": "chbe"
    },
    {
        "name": "CHBE 599",
        "title": "Thesis",
        "credits": 1,
        "desc": "For M.A.Sc. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 348,
        "y": 414,
        "group": "chbe"
    },
    {
        "name": "CHBE 697",
        "title": "Ph.D. Thesis Proposal Development",
        "credits": 2,
        "desc": "Techniques for preparation of a critical literature review and focussed research proposal for Ph.D. candidates. Students perform oral and written critiques of published research in their area of study, define research questions and hypotheses, and develop a focussed research proposal. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 349,
        "y": 420,
        "group": "chbe"
    },
    {
        "name": "CHBE 699",
        "title": "Doctoral Dissertation",
        "credits": 0,
        "desc": "\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 349,
        "y": 426,
        "group": "chbe"
    }
]