[
    {
        "name": "CPEN 211",
        "desc": "Boolean algebra; combinational and sequential circuits; organization and operation of microcomputers, memory addressing modes, representation of information, instruction sets, machine and assembly language programming, systems programs, I/O structures, I/O interfacing and I/O programming, introduction to digital system design using microcomputers. Credit will be granted for only one of CPEN 211, CPEN 312, EECE 256, EECE 259 or EECE 355. This course is not eligible for Credit/D/Fail grading. [4-2-2*]\n",
        "prereqs": "APSC 160.",
        "coreqs": ""
    },
    {
        "name": "CPEN 212",
        "desc": "Computer architecture and the hardware- software interface: pipelining; caches; virtual memory; memory management; linking; concurrency; introduction to compilers. [3-2-0]\n",
        "prereqs": "CPEN 211 and one of CPEN 221, CPEN 223, CPSC 259.",
        "coreqs": ""
    },
    {
        "name": "CPEN 221",
        "desc": "Design, implementation, reasoning about software systems: abstraction and specification of software, testing, verification, abstract data types, object-oriented design, type hierarchies, concurrent software design. This course is not eligible for Credit/D/Fail grading. [3-2-2*]\n",
        "prereqs": "APSC 160.",
        "coreqs": ""
    },
    {
        "name": "CPEN 223",
        "desc": "Introduction to robust software design: static typing, procedural specifications, unit testing, black-box & white-box tests, user- defined data types (representations, invariants, abstraction functions), data abstractions, communicating design (e.g., UML). This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "APSC 160.",
        "coreqs": ""
    },
    {
        "name": "CPEN 281",
        "desc": "Written and oral communication in engineering. Technical description, report preparation, business correspondence, and oral presentation of technical material. Restricted to students in second year of Electrical and Computer Engineering programs. Credit will be granted for only one of ELEC 281, CPEN 281, BMEG 201 or APSC 201. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "prereqs": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.",
        "coreqs": ""
    },
    {
        "name": "CPEN 291",
        "desc": "Design projects involving hardware (electronic devices and circuits, microcomputers) and software. This course is not eligible for Credit/D/Fail grading. [2-6-0]\n",
        "prereqs": "CPEN 211.",
        "coreqs": "ELEC 201."
    },
    {
        "name": "CPEN 311",
        "desc": "Advanced combinational and sequential electronic system design. Hardware specification, modelling, and simulation using hardware description languages (HDLs) and CAD tools. Design with programmable logic including FPGA's. Applications include complex state machines, microcontrollers, arithmetic circuits, and interface units. This course is not eligible for Credit/D/Fail grading. [3-3-0]\n",
        "prereqs": "One of CPEN 211, CPEN 312.",
        "coreqs": ""
    },
    {
        "name": "CPEN 312",
        "desc": "Data representation in digital computers; boolean algebra; the design and optimization and implementation of combinatorial and sequential circuits; modern digital circuit technologies; memory and programmable logic devices; organization and operation of microcomputers; data/address bus organization; input-output interfacing. Credit will be granted for only one of CPEN 312, CPEN 211. This course is not eligible for Credit/D/Fail grading This course is not eligible for Credit/D/Fail grading. [3-2*-0]\n",
        "prereqs": "One of ELEC 201, ELEC 204, ELEC 203, MECH 221.",
        "coreqs": ""
    },
    {
        "name": "CPEN 321",
        "desc": "Engineering practices for the development of non-trivial software-intensive systems including requirements specification, software architecture, implementation, verification, and maintenance. Iterative development. Recognized standards, guidelines, and models. Credit will only be granted for only one of CPSC 310, CPEN321. This course is not eligible for Credit/D/Fail grading. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "CPEN 322.",
        "coreqs": ""
    },
    {
        "name": "CPEN 322",
        "desc": "Contemporary concepts and techniques for developing interactive software applications: client-server architectures; session-oriented systems; security and scalability; models of application deployment. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "CPEN 221 and CPSC 221",
        "coreqs": ""
    },
    {
        "name": "CPEN 331",
        "desc": "Operating systems, their design and their implementation. Process concurrency, synchronization, communication and scheduling. Device drivers, memory management, virtual memory, file systems, networking and security. This course is not eligible for Credit/D/Fail grading. [3-3-0]\n",
        "prereqs": "One of CPSC 261, CPEN 212 and CPEN 221.",
        "coreqs": ""
    },
    {
        "name": "CPEN 333",
        "desc": "Use of operating systems abstractions; real-time systems; principles of concurrent and multi-threaded programming; information structures; introduction to object oriented analysis; design, and modelling using UML; software testing. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "One of CPSC 259, CPEN 223.",
        "coreqs": ""
    },
    {
        "name": "CPEN 391",
        "desc": "Design and implementation of a hardware platform and software design and implementation at the operating system and application layers.  Project management skills. Effective presentations. This course is not eligible for Credit/D/Fail grading. [2-6-0]\n",
        "prereqs": "All of CPEN 212, CPSC 221, CPEN 291 and one of CPEN 311, CPEN 322.",
        "coreqs": ""
    },
    {
        "name": "CPEN 400",
        "desc": "Lectures or projects on subjects of current interest. \n"
    },
    {
        "name": "CPEN 411",
        "desc": "Modern processors, GPUs, and memory hierarchies; quantitative principles and instruction set design; pipelining, superscalar issue, out-of-order execution, branch prediction and speculation; memory hierarchies, caches, virtual addressing, prefetching, coherence, and consistency; multicores, VLIW, on-chip networks, and other advanced architectures. Credit will be granted for only one of CPSC 313, CPEN 411. This course is not eligible for Credit/D/Fail grading. This course is not eligible for Credit/D/Fail grading. [3-0-2]\n",
        "prereqs": "One of CPEN 212, CPEN 311, CPEN 312.",
        "coreqs": ""
    },
    {
        "name": "CPEN 412",
        "desc": "Microprocessor and system buses; advanced I/O methods; priority interrupts; event/exception handling; serial I/O; computer networking; memory system design; interaction of hardware and software, microprocessor comparison, testability issues, safety critical systems. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "CPEN 311 and one of CPEN 211, CPEN 312.",
        "coreqs": ""
    },
    {
        "name": "CPEN 421",
        "desc": "Advanced project planning, cost estimation and scheduling. Project management tools. Factors influencing productivity and success. Productivity metrics. Analysis of options and risk. Tools. Case studies. This course is not eligible for Credit/D/Fail grading. [3-0-2]\n",
        "prereqs": "One of CPEN 321, CPSC 310.",
        "coreqs": ""
    },
    {
        "name": "CPEN 422",
        "desc": "Different levels of testing including unit, integration, system, performance and regression levels. Requirements flowdown. Problem tracking. Coverage criteria. Static methods. Tools support. Specialized techniques. Assessment of correctness, reliability, safety. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "One of CPEN 221, CPEN 321, CPSC 210, CPSC 310.",
        "coreqs": ""
    },
    {
        "name": "CPEN 423",
        "desc": "Software architecture as a bridge from requirements to implementation. Architectural description and patterns. Iterative development. Use of commercial off-the-shelf products. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "One of CPEN 221, CPEN 321, CPSC 310.",
        "coreqs": ""
    },
    {
        "name": "CPEN 431",
        "desc": "Communications, processes, naming, synchronization, consistency and replication, fault tolerance, object-based middleware, and security technologies for distributed applications. [3-2-0]\n",
        "prereqs": "One of CPEN 331, CPSC 313 and one of CPEN 221, CPSC 210.",
        "coreqs": "One of ELEC 331, CPSC 317."
    },
    {
        "name": "CPEN 432",
        "desc": "Multi-tasking; interrupt-driven systems; task scheduling; schedulability analysis; inter-process communication and synchronization; resource management; performance measurement; hardware/software integration; hardware/software tradeoffs; system reliability. This course is not eligible for Credit/D/Fail grading. [3-0-2]\n",
        "prereqs": "One of CPEN 333, CPEN 331, CPSC 313.",
        "coreqs": ""
    },
    {
        "name": "CPEN 441",
        "desc": "Practical issues for interfaces for modern software. Task analysis, user modelling, usability engineering, representations, metaphors, prototyping tools. Applications: interactive multimedia systems, engineering, scientific visualization, engineering design. This course is not eligible for Credit/D/Fail grading. [3-1-2*]\n",
        "prereqs": "One of CPSC 260, CPSC 221 and one of CPEN 221, CPSC 210, CPEN 333.",
        "coreqs": ""
    },
    {
        "name": "CPEN 442",
        "desc": "Security risks, threats, and vulnerabilities from technical perspectives; cryptography; software and web security; access control, assurance, accountability; usable privacy and security; engineering of secure systems; cryptocurrencies. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "prereqs": "One of CPEN 333, CPEN 331, CPSC 313.",
        "coreqs": ""
    },
    {
        "name": "CPEN 481",
        "desc": "Time-money relationships; economic analysis of alternatives including the effects of interest rates, inflation, depreciation, taxation and uncertainty; cost estimation and budgeting; financial analysis of engineering operations. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n"
    },
    {
        "name": "CPEN 491",
        "desc": "Design, analysis, and implementation of solutions in response to a real-world computer engineering problem, provided by industry, research laboratories, or other suitable entities. Includes coverage of topics such as project management. This course is not eligible for Credit/D/Fail grading. [2-6-0] or [2-6-0; 2-6-0]\n",
        "prereqs": "CPEN 391.",
        "coreqs": ""
    },
    {
        "name": "CPEN 497",
        "desc": "Directed research experience. Communication of research ideas. Pass/Fail. This course is not eligible for Credit/D/Fail grading. \n",
        "prereqs": "Third-year standing.",
        "coreqs": ""
    },
    {
        "name": "CPEN 499",
        "desc": "Project in electrical engineering or computer engineering involving design, experimental and/or computer simulation work as selected from topics supplied by faculty members. An individual project thesis is to be prepared according to specifications available from the departmental office. This course is not eligible for Credit/D/Fail grading. [0-6-0] or [0-12-0]\n"
    },
    {
        "name": "CPEN 502",
        "desc": "Credit will only be given for one of CPEN 502 or EECE 592. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 511",
        "desc": "Credit will only be given for one of CPEN 511 or EECE 527. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 512",
        "desc": "Credit will only be given for one of CPEN 512 or EECE 528. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 513",
        "desc": "Credit will only be given for one of CPEN 513 or EECE 583 This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 521",
        "desc": "Credit will only be given for one of CPEN 521 or EECE 511. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 522",
        "desc": "Credit will only be given for one of CPEN 522 or EECE 514. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 523",
        "desc": "Credit will only be given for one of CPEN 523 or EECE 543 or CPEN 421. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 524",
        "desc": " This course is not eligible for Credit/D/Fail grading.\n"
    },
    {
        "name": "CPEN 533",
        "desc": "Credit will only be given for one of CPEN 533 or EECE 513. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 541",
        "desc": "Credit will only be given for one of CPEN 541 or EECE 518. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 542",
        "desc": "Credit will only be given for one of CPEN 542 or EECE 512. This course is not eligible for Credit/D/Fail grading. \n"
    },
    {
        "name": "CPEN 642",
        "desc": "\n",
        "prereqs": "by permission of the instructor.",
        "coreqs": ""
    }
]