[
    {
        "name": "ENPH 253",
        "title": "Introduction to Instrument Design",
        "credits": 5,
        "desc": "Practice in engineering design and instrument development including mechanical and electrical design, and communications with sensors, actuators. Micro-controller implementation and system integration. Engineering design review process and presentations. Engineering communication in design and product release. [3-6-0]\nPrerequisite: ENPH 259.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 1.0,
        "y": 0.0,
        "group": "enph"
    },
    {
        "name": "ENPH 257",
        "title": "Heat and Thermodynamics",
        "credits": 2,
        "desc": "Thermometry, thermal properties of matter; heat transfer by conduction; convection and radiation; kinetic theory of gases and gas laws; heat engines; refrigeration; change of state; first and second laws of thermodynamics. [1-3-1]\nPrerequisite: Either (a) SCIE 001 or (b) one of MATH 200, MATH 217, MATH 226, MATH 254, MATH 255;  and either (a) all of PHYS 108, PHYS 109 or (b) one of PHYS 102, PHYS 153 or (c) all of PHYS 157, PHYS 158, PHYS 159 or (d) all of PHYS 118, PHYS 119 or (e) all of PHYS 108, PHYS 119.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 0.8090169943749475,
        "y": 0.5877852522924731,
        "group": "enph"
    },
    {
        "name": "ENPH 259",
        "title": "Experimental Techniques",
        "credits": 3,
        "desc": "Basic experimental techniques in acquisition, analysis, and presentation and communication of data and technical results. [2-3-0]\nPrerequisite: One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150 and either (a) all of PHYS 108, PHYS 109 or (b) one of PHYS 102, PHYS 153 or (c) SCIE 001 or (d) all of PHYS 157, PHYS 158, PHYS 159 or (e) all of PHYS 118, PHYS 119 or (f) all of PHYS 108, PHYS 119.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 0.30901699437494745,
        "y": 0.9510565162951535,
        "group": "enph"
    },
    {
        "name": "ENPH 270",
        "title": "Mechanics II",
        "credits": 2,
        "desc": "Dynamics: systems of particles, kinematics and kinetics of rigid bodies (plane motion), energy and momentum, rotating coordinates. [2-0-1]\nPrerequisite: PHYS 170.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -0.30901699437494734,
        "y": 0.9510565162951536,
        "group": "enph"
    },
    {
        "name": "ENPH 352",
        "title": "Laboratory Techniques in Physics",
        "credits": 2,
        "desc": "Some of the experiments will be based on the lecture material for PHYS 301. Other techniques and subjects will also be covered. [0-3-0]\nCorequisite: PHYS 301.\n",
        "coreqs": [
            "PHYS 301"
        ],
        "prereqs": [],
        "postreqs": [],
        "x": -0.8090169943749473,
        "y": 0.5877852522924732,
        "group": "enph"
    },
    {
        "name": "ENPH 353",
        "title": "Engineering Physics Project I",
        "credits": 3,
        "desc": "Engineering project planning, execution and reporting. The course involves carrying out an open-ended Engineering project to meet specific performance metrics on an industry relevant topic selected by instructors. Reporting on progress is both oral and written. This course is not eligible for Credit/D/Fail grading. [0-6-1]\nPrerequisite: All of ENPH 253, CPEN 221.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -1.0,
        "y": 1.2246467991473532e-16,
        "group": "enph"
    },
    {
        "name": "ENPH 459",
        "title": "Engineering Physics Project II",
        "credits": 5,
        "desc": "Project planning, management and reporting. This course involves writing a project proposal, carrying out an open-ended Engineering project, and reporting the results both orally and in writing. This course is not eligible for Credit/D/Fail grading. [1-3-0; 0-6-1]\nPrerequisite: ENPH 253.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -0.8090169943749476,
        "y": -0.587785252292473,
        "group": "enph"
    },
    {
        "name": "ENPH 479",
        "title": "Engineering Physics Project III",
        "credits": 6,
        "desc": "Projects designed to give students research development and design experience. Projects are provided by research faculty in Science and Engineering and from local industry. This course is not eligible for Credit/D/Fail grading. [1-5-1;0-4-0]\nPrerequisite: ENPH 459.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -0.30901699437494756,
        "y": -0.9510565162951535,
        "group": "enph"
    },
    {
        "name": "ENPH 480",
        "title": "Engineering Physics Project IV",
        "credits": 3,
        "desc": "An optional course for those students wishing to continue their project work beyond the development in ENPH 479. This course is not eligible for Credit/D/Fail grading. [0-6-0]\nPrerequisite: ENPH 479.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 0.30901699437494723,
        "y": -0.9510565162951536,
        "group": "enph"
    },
    {
        "name": "ENPH 481",
        "title": "Entrepreneurial Projects I",
        "credits": 3,
        "desc": "A project course for students pursuing entrepreneurial training within Engineering Physics, and wishing to further develop projects resulting from ENPH 459. This course is not eligible for Credit/D/Fail grading. [0-5-1]\nPrerequisite: ENPH 459.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": 0.8090169943749473,
        "y": -0.5877852522924734,
        "group": "enph"
    }
]