[
    {
        "name": "EOSC 110",
        "title": "The Solid Earth: A Dynamic Planet",
        "credits": 3,
        "desc": "Earth's origin, composition, structure, and natural resources. Plate tectonics as the driving force for volcanism, mountain building, and earthquakes.  Imaging Earth's interior. Environmental geoscience and sustainability. (Consult the Credit Exclusion list for the Faculty of Science section of  the Calendar.) [3-0-0]\nCorequisite: EOSC 111 is recommended.\n",
        "coreqs": [
            "EOSC 111"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 111",
        "title": "Laboratory Exploration of Planet Earth",
        "credits": 1,
        "desc": "An examination of the processes that shape and change the planet earth. This laboratory course is an appropriate complement to EOSC 110, EOSC 112, EOSC 114, EOSC 116 but can also be taken independently. [0-3-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 112",
        "title": "The Fluid Earth: Atmosphere and Ocean",
        "credits": 3,
        "desc": "Introduction to processes in ocean and atmosphere. Heat, current, winds, clouds, marine life, resources. Effects of coupling, climate change, pollution. (Consult the Credit Exclusion list, within the Faculty of Science section in the Calendar.) [3-0-0]\nCorequisite: EOSC 111 is recommended.\n",
        "coreqs": [
            "EOSC 111"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 114",
        "title": "The Catastrophic Earth: Natural Disasters",
        "credits": 3,
        "desc": "Introduction to causes and physical characteristics of disasters such as volcanic eruptions, earthquakes, tsunamis, hurricanes, storm surge, thunderstorms, tornadoes, landslides, wind waves, meteor impacts, mass extinctions. [3-0-0]\nCorequisite: EOSC 111 is recommended.\n",
        "coreqs": [
            "EOSC 111"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 116",
        "title": "Mesozoic Earth: Time of the Dinosaurs",
        "credits": 3,
        "desc": "Earth's tectonics, climate, and oceans during the time of the dinosaurs.  Reading the fossil record of Earth from its earliest origins up to and including the Mesozoic, 250 - 65 million years ago. [3-0-0]\nCorequisite: EOSC 111 is recommended.\n",
        "coreqs": [
            "EOSC 111"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 118",
        "title": "Earth's Treasures: Gold and Gems",
        "credits": 3,
        "desc": "Origin, properties, valuation, prospecting and geology of gold, platinum, silver, diamonds, rubies, emeralds, and other precious metals and gems. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 210",
        "title": "Earth Science for Engineers",
        "credits": 3,
        "desc": "Focus on the interaction between society and the geologic environment.  Locating, assessing and developing natural resources; understanding and preparing for natural hazards, design of structures and waste disposal sites.  For applied science and forestry students only. [3-2-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 211",
        "title": "Computer Methods in Earth, Ocean and Atmospheric Sciences",
        "credits": 3,
        "desc": "Mathematical computer-based problem solving in the physical, chemical, and biological sciences. Problems drawn from studies of the earth, the oceans and the atmosphere. Credit will be granted for only one of APSC 160, CPSC 301, or EOSC 211. [2-0-2]\nPrerequisite: One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001.\n",
        "coreqs": [],
        "prereqs": [
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 212",
        "title": "Topics in the Earth and Planetary Sciences",
        "credits": 3,
        "desc": "Cutting edge problems in earth, ocean, atmospheric and planetary sciences.  Topics will be introduced through discussions of the current literature. [3-0-0]\nPrerequisite: Second-year standing in science or engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 213",
        "title": "Computational Methods in Geological Engineering",
        "credits": 3,
        "desc": "Combining basic physical principles with their mathematical description and generating computational models that describe them. Introduction to basic building blocks in modelling, simulation and parameter estimation. [3-1-0]\nPrerequisite: One of MATH 200, MATH 253 and one of MATH 152, MATH 221, MATH 223 and one of APSC 160, CPSC 103, CPSC 110, EOSC 211.\n",
        "coreqs": [],
        "prereqs": [
            "MATH 200",
            "MATH 253",
            "MATH 152",
            "MATH 221",
            "MATH 223",
            "APSC 160",
            "CPSC 103",
            "CPSC 110",
            "EOSC 211"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 220",
        "title": "Introductory Mineralogy",
        "credits": 3,
        "desc": "Introduction to crystallography, physical and chemical properties of minerals. Recognition and identification of common minerals. Please consult the Faculty of Science Credit Exclusion List: www.students.ubc.ca/calendar/index.cfm?tree=12,215,410,414. [2-3-0]\nPrerequisite: One of CHEM 110, CHEM 111, CHEM 120, CHEM 121, SCIE 001.\n",
        "coreqs": [],
        "prereqs": [
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 221",
        "title": "Introductory Petrology",
        "credits": 3,
        "desc": "Optical mineralogy and the classification and genesis of igneous, metamorphic and sedimentary rocks. [2-3-0]\nPrerequisite: EOSC 220.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 220"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 222",
        "title": "Geological Time and Stratigraphy",
        "credits": 3,
        "desc": "Measuring geological time and understanding Earth history using stratigraphic principles, paleontology and radioactive decay. Please consult the Faculty of Science Credit Exclusion List: www.students.ubc.ca/calendar/index.cfm?tree=12,215,410,414. [2-2-0]\nPrerequisite: Second-year standing in Science. One of EOSC 1**, EOSC 210, GEOB 103 is recommended.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 223",
        "title": "Field Techniques",
        "credits": 3,
        "desc": "Introduction to the techniques of geological mapping and the interpretation of field data. Includes three one-day field trips on weekends plus a seven-day field school after Spring examinations. A fee is to be paid by January 31. [2-2-0]\nCorequisite: EOSC 221.\n",
        "coreqs": [
            "EOSC 221"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 240",
        "title": "Site Investigation",
        "credits": 3,
        "desc": "Theory and practice of site investigation for geological engineers, including background studies, field work, remote sensing, development of ground models, importance of geological variability and uncertainty. Impacts on design, project risk and decision making. [2-2-0]\nPrerequisite: EOSC 210.\nCorequisite: CIVL 210.\n",
        "coreqs": [
            "CIVL 210"
        ],
        "prereqs": [
            "EOSC 210"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 250",
        "title": "Fields and Fluxes",
        "credits": 3,
        "desc": "Application of classical theory of scalar and vector fields to geophysical sciences. Conductive, convective and radiative energy flux, gravitation, electrostatics, and magnetostatics. Gauss' and Stokes' theorems. [3-0-0]\nPrerequisite: One of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 157.\nCorequisite: MATH 200. One of PHYS 108, 118, 158 is recommended.\n",
        "coreqs": [
            "MATH 200"
        ],
        "prereqs": [
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 256",
        "title": "Earthquakes",
        "credits": 3,
        "desc": "Characteristics, types, plate tectonics, faults, earth stresses and strains, seismic waves, magnitude scales, instrumentation, hazard mapping, prediction, and forecasting. [3-0-0]\nPrerequisite: Either (a) one of MATH 101, MATH 103, MATH 105, MATH 121 and one of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 157;  or (b) SCIE 001.\n",
        "coreqs": [],
        "prereqs": [
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 157",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 270",
        "title": "Marine Ecosystems",
        "credits": 3,
        "desc": "Introduction to diversity of marine habitats and ecosystems; hydrothermal vent, intertidal, coral reef, estuarine, deep sea, and polar ecosystems; impacts of ecosystem change; evolution of ocean plankton; invasive species; climate change; pollution. [3-0-0]\nPrerequisite: One of SCIE 001, CHEM 110, CHEM 111, CHEM 120, CHEM 121, CHEM 154.\n",
        "coreqs": [],
        "prereqs": [
            "SCIE 001",
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "CHEM 154"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 310",
        "title": "The Earth and the Solar System",
        "credits": 3,
        "desc": "The Earth as a planet: its composition, internal dynamics, and surface evolution. Rotation, magnetic field, plate tectonics, earthquakes, volcanoes. The ocean, atmosphere, and biosphere as components of a varying geo-environment. Not for credit in the Faculties of Science and Applied Science. No background in science or mathematics is required. Please consult the Faculty of Science Credit Exclusion List: www.students.ubc.ca/calendar/index.cfm?tree=12,215,410,414. [3-0-0]\nPrerequisite: Second-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 311",
        "title": "The Earth and its Resources",
        "credits": 3,
        "desc": "An introduction to the Earth with emphasis on its industrial and aesthetic resources. Rocks, minerals, gold, diamonds, sediments, fossils, oil and gas, canyons, and volcanoes and the processes that create them. Not for credit in the Faculties of Science and Applied Science. No background in Science or Mathematics is required. [3-0-0]\nPrerequisite: Second-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 314",
        "title": "The Ocean Environment",
        "credits": 3,
        "desc": "An introduction to the oceans and the processes that have shaped them, their composition and movement, waves, tides, beaches, interactions with the atmosphere and human exploitation of the non-living resources. Not for credit in the Faculties of Science or Applied Science. No background in Science or Mathematics is required. [3-0-0]\nPrerequisite: Second-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 315",
        "title": "The Ocean Ecosystem",
        "credits": 3,
        "desc": "An introduction to life in the oceans, its variety and evolution; primary producers and their links to the environment, zooplankton, marine communities, living marine resources and their role in today's world. Not for credit in the Faculties of Science or Applied Science. [3-0-0]\nPrerequisite: Second-year standing\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 320",
        "title": "Sedimentology",
        "credits": 3,
        "desc": "Origin, diagenesis and geochemistry of sediments and sedimentary rocks. [2-2-0]\nPrerequisite: EOSC 221 and one of EOSC 210, EOSC 222.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221",
            "EOSC 210",
            "EOSC 222"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 321",
        "title": "Igneous Petrology",
        "credits": 3,
        "desc": "The origin and formation of igneous rocks. [2-3-0]\nPrerequisite: EOSC 221.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 322",
        "title": "Metamorphic Petrology",
        "credits": 3,
        "desc": "Deciphering lithospheric processes as recorded by the mineralogy, chemistry and textures of metamorphosed rocks. [2-3-0]\nPrerequisite: EOSC 221.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 323",
        "title": "Structural Geology I",
        "credits": 3,
        "desc": "Analysis and interpretation of natural deformation. [2-3-0]\nPrerequisite: All of EOSC 221, EOSC 223 and one of EOSC 210, EOSC 222.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221",
            "EOSC 223",
            "EOSC 210",
            "EOSC 222"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 325",
        "title": "Principles of Physical Hydrogeology",
        "credits": 3,
        "desc": "Theories of storage and movement of water within groundwater systems; Groundwater-surface water interaction; Role of groundwater systems in watershed management and regulating the environmental impacts of global change; Groundwater sustainability; Impacts of climate & land use changes on groundwater resources This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: 3rd year standing in Science, Land and Food Systems or Forestry; and\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 326",
        "title": "Earth and Life Through Time",
        "credits": 3,
        "desc": "The fossil record of adaptation and extinction emphasizing the interaction of biological and geological processes. Not for credit in Geological Sciences and Geophysics specializations. Please consult the Faculty of Science Credit Exclusion List: http://www.calendar.ubc.ca/vancouver/index.cfm?tree=12,215,410,414. [3-0-0]\nPrerequisite: Biology 100-level and third-year standing in Science.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 327",
        "title": "Geochemical Thermodynamics",
        "credits": 3,
        "desc": "Application of chemical thermodynamics to problem solving in the earth sciences.  Geochemical tools are developed for: low-T aqueous geochemistry, high-T, high-P processes in the lithosphere, ore-deposit formation, and for prediction of geochemical reaction rates in all environments. [2-2-0]\nPrerequisite: EOSC 220.\nCorequisite: CHEM 205.\n",
        "coreqs": [
            "CHEM 205"
        ],
        "prereqs": [
            "EOSC 220"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 328",
        "title": "Field Geology",
        "credits": 3,
        "desc": "Recording and processing geological data in the field. Held within the three weeks following April examinations after third year. A special fee is to be paid by January 31. \nPrerequisite: All of EOSC 323, EOSC 330 and one of EOSC 321, EOSC 322.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 323",
            "EOSC 330",
            "EOSC 321",
            "EOSC 322"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 329",
        "title": "Quantitative Groundwater Hydrology",
        "credits": 3,
        "desc": "Introduction to theory of groundwater flow; flow nets; regional groundwater resource evaluation; well hydraulics; role of groundwater in geologic processes, case studies. [2-3*-3*]\nPrerequisite: One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001.\n",
        "coreqs": [],
        "prereqs": [
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 330",
        "title": "Principles of Geomorphology",
        "credits": 3,
        "desc": "Landform development; morphological and historical analysis of landforms; applications in engineering and resource development. Please consult the Faculty of Science Credit Exclusion List: www.students.ubc.ca/calendar/index.cfm?tree=12,215,410,414. [3-2-0]\nPrerequisite: One of GEOB 103, EOSC 110, EOSC 210.\n",
        "coreqs": [],
        "prereqs": [
            "GEOB 103",
            "EOSC 110",
            "EOSC 210"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 331",
        "title": "Introduction to Mineral Deposits",
        "credits": 3,
        "desc": "Introduction to economic geology and models related to mineral exploration. Study includes typical deposit types and their plate tectonic setting. [2-3-0]\nPrerequisite: EOSC 221.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 332",
        "title": "Tectonic Evolution of North America",
        "credits": 3,
        "desc": "An overview of the geology and tectonic evolution of North America; comparisons and contrasts between Precambrian rocks of the North American craton and Phanerozoic belts of the Cordilleran, Appalachian, Ouachita and Innuitian orogens;  interrelations between sedimentation, deformation, metamorphism and magmatism in a plate tectonic context. [3-0-0]\nPrerequisite: EOSC 323 or permission of the instructor.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 323"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 333",
        "title": "Elemental and Isotopic Geochemistry",
        "credits": 3,
        "desc": "Analytical methods in geochemistry, major and trace element geochemistry, radiogenic isotopes, geochemistry of seawater, the mantle, basalts, subduction zones, sedimentary rocks, continental crust. [2-3-0]\nPrerequisite: EOSC 221.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 221"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 340",
        "title": "Global Climate Change",
        "credits": 3,
        "desc": "Mechanisms and processes of past and future global environmental and climate change. [3-0-0]\nPrerequisite: Either (a) SCIE 001 or (b) one of CHEM 110, CHEM 111, CHEM 120, CHEM 121, CHEM 154 and one of MATH 101, MATH 103, MATH 105, MATH 121 and one of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 153, PHYS 157.\n",
        "coreqs": [],
        "prereqs": [
            "SCIE 001",
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "CHEM 154",
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 153",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 350",
        "title": "Environmental, Geotechnical, and Exploration Geophysics I",
        "credits": 3,
        "desc": "Principles of geophysical survey design, data acquisition, processing and interpretation with emphasis on near-surface problems. Magnetic, seismic reflection/refraction, electromagnetic and ground penetrating radar surveys. Case history analysis of environmental and geotechnical problems. [3-2-0]\nPrerequisite: One of MATH 200, MATH 253 and third-year standing or higher in Science or Applied Science.\n",
        "coreqs": [],
        "prereqs": [
            "MATH 200",
            "MATH 253"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 352",
        "title": "Geophysical Continuum Dynamics",
        "credits": 3,
        "desc": "Introduction to tensor calculus and continuum mechanics. Stress, strain and strain-rate tensors. Mass, momentum and energy balance. Applications to problems of geophysical heat transport, elasticity and fluid dynamics. [3-0-0]\nPrerequisite: One of EOSC 250, MATH 317.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 250",
            "MATH 317"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 353",
        "title": "Seismology",
        "credits": 3,
        "desc": "Hooke's law for isotropic continua, elastic wave equation, reflection and refraction methods for imaging the Earth's internal structure, plane waves in an infinite medium and interaction with boundaries, body wave seismology, inversion of travel-time curves, generalized ray theory, crustal seismology, surface waves and earthquake source studies. [3-3*]\nPrerequisite: EOSC 352.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 352"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 354",
        "title": "Analysis of Time Series and Inverse Theory for Earth Scientists",
        "credits": 3,
        "desc": "Continuous and discrete Fourier transforms, correlation and convolution, spectral estimates, optimum least-squares filters, deconvolution and prediction, frequency-wave number filtering. A practical course on computer techniques applied to the analysis of a wide range of geophysical phenomena. [3-2-0]\nPrerequisite: Either (a) SCIE 001 or (b) one of MATH 101, MATH 103, MATH 105, MATH 121 and one of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 157.\n",
        "coreqs": [],
        "prereqs": [
            "SCIE 001",
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 355",
        "title": "The Planets",
        "credits": 3,
        "desc": "Diversity among the planets and moons of the solar system; integrating concepts across scientific disciplines, including geology, geophysics, and atmospheric science to understand how planets evolve. [3-0-0]\nPrerequisite: Either (a) SCIE 001 or (b) one of MATH 101, MATH 103, MATH 105, MATH 121;  and one of CHEM 110, CHEM 111, CHEM 120, CHEM 121, CHEM 154 and one of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 153, PHYS 157.\n",
        "coreqs": [],
        "prereqs": [
            "SCIE 001",
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "CHEM 154",
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 153",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 372",
        "title": "Introductory Oceanography: Circulation and Plankton",
        "credits": 3,
        "desc": "Physical and chemical processes and their controls on the distribution of plankton in the ocean. [3-0-0]\nPrerequisite: Either (a) SCIE 001 or (b) one of CHEM 110, CHEM 111, CHEM 120, CHEM 121, CHEM 154 and one of MATH 101, MATH 103, MATH 105, MATH 121 and one of PHYS 101, PHYS 106, PHYS 107, PHYS 117, PHYS 131, PHYS 153, PHYS 157.\n",
        "coreqs": [],
        "prereqs": [
            "SCIE 001",
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "CHEM 154",
            "MATH 101",
            "MATH 103",
            "MATH 105",
            "MATH 121",
            "PHYS 101",
            "PHYS 106",
            "PHYS 107",
            "PHYS 117",
            "PHYS 131",
            "PHYS 153",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 373",
        "title": "Introductory Oceanography: Climate and Ecosystems",
        "credits": 3,
        "desc": "Physical, chemical, and biological processes in the ocean and their interaction with climate and marine food-webs. [3-0-0]\nPrerequisite: EOSC 372.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 372"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 398",
        "title": "Co-operative Work Placement I",
        "credits": 3,
        "desc": "Approved and supervised technical work experience in an industrial, university or government setting for a minimum of 14 weeks. Normally taken in the Summer Session (Terms 1 and 2) following second year. Technical report required. Restricted to students admitted to the Co-operative Education Option in Earth, Ocean and Atmospheric Sciences. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 399",
        "title": "Co-operative Work Placement II",
        "credits": 3,
        "desc": "Approved and supervised technical work experience in an industrial, university or government setting for a minimum of 14 weeks. Normally taken in Winter Session (Term 1) in third year. Technical report required. Restricted to students admitted to the Co-operative Education Option in Earth, Ocean and Atmospheric Sciences. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 410",
        "title": "Geoscientific Data Analysis and Empirical Modelling",
        "credits": 3,
        "desc": "Application of data analysis and empirical modelling strategies for conducting a data-oriented research in geosciences; from setting research questions and hypothesis to delivering and interpreting results. Examples are drawn from across the Earth, ocean, atmospheric and planetary sciences. [3-0-0]\nPrerequisite: One of STAT 200, BIOL 300 and one of MATH 200, EOSC 250 and EOSC 211 and one of EOSC 212, ENVR 300 and one of CPSC 203, CPSC 210. And third-year standing in Geophysics, Environmental Science, Earth and Ocean Science, Atmospheric Science, Geology, Oceanography or Geological Engineering;\n",
        "coreqs": [],
        "prereqs": [
            "STAT 200",
            "BIOL 300",
            "MATH 200",
            "EOSC 250",
            "EOSC 211",
            "EOSC 212",
            "ENVR 300",
            "CPSC 203",
            "CPSC 210"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 420",
        "title": "Volcanology",
        "credits": 3,
        "desc": "Field and lab-based studies in volcanology concentrating on physical and chemical aspects of volcanic processes. [2-3-0]\nPrerequisite: All of EOSC 220, EOSC 221.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 220",
            "EOSC 221"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 421",
        "title": "Advanced Sedimentology",
        "credits": 3,
        "desc": "Description and interpretation of ancient and modern sediments, with emphasis on the origin, composition, textures, structures, diagenesis and chemistry of biogenic sediments. [2-2-0]\nPrerequisite: EOSC 320 or permission of instructor.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 320"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 422",
        "title": "Structural Geology II",
        "credits": 3,
        "desc": "Studies of natural deformation using advanced techniques. [2-3-0]\nPrerequisite: EOSC 323.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 323"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 424",
        "title": "Advanced Mineral Deposits",
        "credits": 3,
        "desc": "Advanced concepts in the processes that lead to the formation of mineral deposits. Introduction to the study of ore minerals using reflected light microscopy. [2-3-0]\nPrerequisite: EOSC 331.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 331"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 425",
        "title": "Paleontology",
        "credits": 3,
        "desc": "Paleobiogeography in the context of plate tectonics. Mass extinction events. Fossilization and biases in the fossil record. Species concepts in paleontology. Biostratigraphy. Paleontological evidence for early life; the colonization of oceanic and terrestrial environments and; the evolution of the primates. [2-3-0]\nPrerequisite: EOSC 222.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 222"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 426",
        "title": "Fundamentals of Geomicrobiology",
        "credits": 3,
        "desc": "Foundational knowledge of the interactions between microorganisms and Earth's surface chemistry. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of BIOL 111, BIOL 112, BIOL 121, CHEM 110, CHEM 111, CHEM 120, CHEM 121, EOSC 110, EOSC 112. Third year standing in Science.\n",
        "coreqs": [],
        "prereqs": [
            "BIOL 111",
            "BIOL 112",
            "BIOL 121",
            "CHEM 110",
            "CHEM 111",
            "CHEM 120",
            "CHEM 121",
            "EOSC 110",
            "EOSC 112"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 428",
        "title": "Field Techniques in Groundwater Hydrology",
        "credits": 3,
        "desc": "Hydraulic head measurements, water-quality sampling, pump and slug testing, infiltration measurements, profiling techniques. Held over five days after spring term at the Richmond groundwater hydrology field-school site. Enrolment limitations. \nPrerequisite: One of EOSC 325, EOSC 329.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 325",
            "EOSC 329"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 429",
        "title": "Groundwater Contamination",
        "credits": 3,
        "desc": "Contaminant transport processes in groundwater flow systems; aqueous and multiphase transport; mathematical models describing migration and chemical evolution of contaminant plumes; case studies. [2-2-0]\nPrerequisite: One of EOSC 325, EOSC 329.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 325",
            "EOSC 329"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 430",
        "title": "Aqueous Geochemistry",
        "credits": 3,
        "desc": "Quantitative approaches to practical aqueous geochemistry problems. Equilibrium thermodynamics, kinetics, complexation, oxidation reduction, cation exchange, sorption and partitioning of organics. Case Studies. [2-2-0]\nPrerequisite: One of CHEM 123, CHEM 130, CHEM 154, SCIE 001.\nCorequisite: One of EOSC 325, EOSC 329.\n",
        "coreqs": [
            "EOSC 325",
            "EOSC 329"
        ],
        "prereqs": [
            "CHEM 123",
            "CHEM 130",
            "CHEM 154",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 431",
        "title": "Groundwater Remediation",
        "credits": 3,
        "desc": "Methods for containment and remediation of subsurface contaminants; including groundwater control, groundwater extraction, and in situ treatment. Experience with common design approaches. [2-2-0]\nPrerequisite: EOSC 429.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 429"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 432",
        "title": "Fossil Fuels",
        "credits": 3,
        "desc": "Origin, geochemistry and distribution of petroleum and coal in the stratigraphic record. Sedimentation of organic matter, organic diagenesis, migration and accumulation of hydrocarbons. Principles of exploration and development. Techniques for measurement of organic maturation and source rock analyses. [2-2-0]\nCorequisite: EOSC 320.\n",
        "coreqs": [
            "EOSC 320"
        ],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 433",
        "title": "Geological Engineering Practice I - Rock Engineering",
        "credits": 3,
        "desc": "Application of rock mechanics, hydrogeology, and engineering design tools in realistically complex geological environments. Influence and treatment of geological uncertainty, and use of field data, geotechnical monitoring, and numerical analyses for tunnelling, mining and rock slope engineering projects. Case histories. [2-2-0]\nPrerequisite: All of EOSC 329, CIVL 210, MINE 303.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 329",
            "CIVL 210",
            "MINE 303"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 434",
        "title": "Geological Engineering Practice II - Soil Engineering",
        "credits": 3,
        "desc": "Application of geomorphology, hydrogeology, and soil mechanics to geotechnical design. Influence and treatment of geological uncertainty in geotechnical hazard and risk assessments; multi-disciplinary approaches to geotechnical engineering problems in realistically complex geological environments. Case histories. [2-2-0]\nPrerequisite: All of EOSC 329, EOSC 330, CIVL 210.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 329",
            "EOSC 330",
            "CIVL 210"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 442",
        "title": "Climate Measurement and Analysis",
        "credits": 1,
        "desc": "Local climate time series collection and analysis. Retrieval and analysis of online climate data and model output. [0-3-0]\nPrerequisite: EOSC 340 and one of CPSC 103, CPSC 110, CPSC 301, EOSC 211, MATH 210, PHYS 210 and one of STAT 200, STAT 201, STAT 251, BIOL 300.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 340",
            "CPSC 103",
            "CPSC 110",
            "CPSC 301",
            "EOSC 211",
            "MATH 210",
            "PHYS 210",
            "STAT 200",
            "STAT 201",
            "STAT 251",
            "BIOL 300"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 445",
        "title": "Engineering Design Project",
        "credits": 6,
        "desc": "Geological engineering design project from scope definition to final design.  Based on a problem from industry. [2*-3-0, 2*-3-0]\nPrerequisite: Fourth-year standing in Geological Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 447",
        "title": "Thesis",
        "credits": 6,
        "desc": "For B.A.Sc. Topic to be approved by the Department. [0-3-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 448",
        "title": "Directed Studies",
        "credits": 3,
        "desc": "Investigation of a topic to be agreed upon by a member of the faculty and the student. Permission of an undergraduate advisor and of the supervising faculty member is required before registration. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 449",
        "title": "Thesis",
        "credits": 6,
        "desc": "Original research work under the direction of a faculty member. Required of all honours students. Open to major students with a satisfactory standing, appropriate background courses and permission of the course instructor and the directing faculty member. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 450",
        "title": "Interior Structure of Earth and Planets",
        "credits": 3,
        "desc": "Theory, application and quantitative interpretation of potential field methods for use in exploring the interior structure of Earth and planets. Topics drawn from problems in geophysical exploration, geodesy, geodynamics, geomagnetism, planetary magnetic fields, heat flow and fluid flow. [3-0-0]\nPrerequisite: One of PHYS 312, MATH 316, MATH 257 and one of PHYS 102, PHYS 108, PHYS 118, PHYS 158, SCIE 001.\n",
        "coreqs": [],
        "prereqs": [
            "PHYS 312",
            "MATH 316",
            "MATH 257",
            "PHYS 102",
            "PHYS 108",
            "PHYS 118",
            "PHYS 158",
            "SCIE 001"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 453",
        "title": "Physics of the Earth and Other Planets",
        "credits": 3,
        "desc": "Identification and quantitative analysis of diverse physical problems in the earth, ocean, atmospheric, and planetary sciences. [3-0-0]\nPrerequisite: One of PHYS 312, MATH 316, MATH 257.\n",
        "coreqs": [],
        "prereqs": [
            "PHYS 312",
            "MATH 316",
            "MATH 257"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 454",
        "title": "Applied Geophysics",
        "credits": 4,
        "desc": "Using geophysics to characterize the Earth's subsurface for resource exploration, engineering, or environmental applications. Data acquisition, processing, and interpretation of geophysical surveys. Inversion examples drawn from potential (electrical, magnetic, gravity) or wave field (seismic, ground penetrating radar) surveys. [3-2-0]\nPrerequisite: All of EOSC 352, EOSC 353, EOSC 450 and one of PHYS 301, PHYS 354.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 352",
            "EOSC 353",
            "EOSC 450",
            "PHYS 301",
            "PHYS 354"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 470",
        "title": "Biological Oceanography",
        "credits": 3,
        "desc": "A quantitative examination of processes regulating the abundance, distribution and production of phytoplankton, zooplankton, microbes and fish. Controls of primary and secondary production, ecosystem dynamics and foodwebs. [3-0-0]\nPrerequisite: One of EOSC 372, EOSC 373.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 372",
            "EOSC 373"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 471",
        "title": "Waves, Currents and Ocean Mixing",
        "credits": 3,
        "desc": "Use of observations, theory and model results to solve physical oceanographic problems including applications to transport and mixing of pollutants or nutrients. [3-0-0]\nPrerequisite: EOSC 211 and one of ATSC 201, EOSC 372, GEOB 200 and one of SCIE 001, PHYS 101, PHYS 107, PHYS 117, PHYS 153, PHYS 157.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 211",
            "ATSC 201",
            "EOSC 372",
            "GEOB 200",
            "SCIE 001",
            "PHYS 101",
            "PHYS 107",
            "PHYS 117",
            "PHYS 153",
            "PHYS 157"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 472",
        "title": "Chemical Oceanography and Marine Geochemistry",
        "credits": 3,
        "desc": "Controls on chemical composition and elemental distributions in seawater and marine sediments (including nutrient elements, dissolved gases, the carbonate system, marine organic matter, and trace metals); solution chemistry of seawater; isotopic tracers of rates and dates in marine systems; geochemical balance in the oceans. [3-0-2*]\nPrerequisite: EOSC 373.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 373"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 473",
        "title": "Methods in Oceanography",
        "credits": 3,
        "desc": "Methods of data acquisition, study and analysis required in solving oceanographic problems. Includes a field school held during the mid-term break. A fee is to be paid by January 31. Open to third- and fourth-year students in Oceanography, or with permission of the Department Head. [0-3-0]\nPrerequisite: One of EOSC 372, EOSC 373.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 372",
            "EOSC 373"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 474",
        "title": "Marine Pollution",
        "credits": 3,
        "desc": "An interdisciplinary study of pollution, with examples drawn from coastal and oceanic environments, including areas of local interest. Intended for third and fourth year students with a background in the sciences. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 475",
        "title": "Marine Microbiology",
        "credits": 3,
        "desc": "Advanced biology, ecology and diversity of marine microbes. Emphasis on the roles of bacteria and viruses in marine foodwebs and geochemical cycles. [3-0-0]\nPrerequisite: A minimum of 6 credits of third-year level life science courses.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 478",
        "title": "Introduction to Fisheries Science",
        "credits": 3,
        "desc": "An introduction to the ecology and management of freshwater and marine fisheries. Topics include: population dynamics, species interactions, communities, environmental influences, stock assessment, economics and sociology of fisheries. Laboratories will consist of numerical analyses and simulations. [2-0-3]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 490",
        "title": "Student Directed Seminars in Earth, Ocean and Atmospheric Sciences",
        "credits": 3,
        "desc": "Self-directed, collaborative studies in earth, ocean and atmospheric sciences, in a group-learning environment, initiated and coordinated by senior undergraduate students with the supervision of a faculty advisor. Course structure, enrolment, and delivery methods will comply with the Handbook for Student Directed Seminars. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: Third-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 498",
        "title": "Co-operative Work Placement III",
        "credits": 3,
        "desc": "Approved and supervised technical work experience in an industrial, university of government setting for a minimum of 14 weeks. Normally taken in the Summer Session (Terms 1 and 2) following third year. Technical report required. Restricted to students admitted to the Co-operative Education Option in Earth, Ocean and Atmospheric Sciences. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 499",
        "title": "Co-operative Work Placement IV",
        "credits": 3,
        "desc": "Approved and supervised technical work experience in an industrial, university or government setting for a minimum of 14 weeks. Normally taken in the Summer Session (Terms 1 and 2) following fourth year. Technical report required. Restricted to students admitted to the Co-operative Education Option in Earth, Ocean and Atmospheric Sciences. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 510",
        "title": "Data Analysis in Atmospheric, Earth and Ocean Sciences",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 511",
        "title": "Numerical Techniques for Ocean, Atmosphere and Earth Scientists",
        "credits": 3,
        "desc": "This course is Web-based. Credit will not be granted for both ATSC 409 and ATSC 506/EOSC 511. This course is not eligible for Credit/D/Fail grading. \nEquivalency: ATSC 506.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 512",
        "title": "Advanced Geophysical Fluid Dynamics",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 513",
        "title": "Imaging and estimation with wavelets",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 514",
        "title": "Introduction to Geological Fluid Mechanics",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 515",
        "title": "Graduate Seminar Course",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 516",
        "title": "Teaching and Learning in Earth, Ocean and Atmospheric Sciences",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 520",
        "title": "Advanced Mineralogy",
        "credits": 3,
        "desc": "Crystal structure, chemistry, origin and paragenesis of major rock-forming and ore minerals. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 521",
        "title": "Microbeam and Diffraction Methods for the Characterization of Minerals and Materials",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading. [2-3-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 522",
        "title": "Methods and Modelling in Petrology and Geochemistry",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading. [3-0-2]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 523",
        "title": "Isotope Geology",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 524",
        "title": "Problems in Paleontology",
        "credits": 3,
        "desc": "Seminar. Given in alternate years. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 525",
        "title": "Magmatic Ore Deposits",
        "credits": 3,
        "desc": "Magmatic ore deposits and associated ore-forming systems with a focus on the petrology and geochemistry of mineralized intrusions and volcanic rocks. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 526",
        "title": "Mechanics of Natural Deformation",
        "credits": 3,
        "desc": "Lectures and laboratory problems. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 528",
        "title": "Advanced Coal Geology",
        "credits": 3,
        "desc": "The origin and character of coal and associated strata. Petrology, chemistry and physical properties of coal. Sedimentology of peat, biochemical and geochemical stages of coalification and oxidation of coal. Use of organic matter as a geothermometer and inbasinal analysis. Structural analysis and character of coal deposits. Analytical methods applied to coal. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 529",
        "title": "Topics in Geohazard Risk Management",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 530",
        "title": "Advanced Igneous Petrology",
        "credits": 3,
        "desc": "Lectures, seminars and laboratories on the application of physical chemistry to the origin of igneous rocks; crystallization processes in silicate magmas; melt physical properties, heat transfer and fluid flow. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 531",
        "title": "Exploration Methodology",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 532",
        "title": "Field Laboratory in Groundwater Hydrology",
        "credits": 3,
        "desc": "Hydraulic head measurements, water-quality sampling, pump and slug testing, infiltration measurements, profiling techniques. Computer analysis of field data. Held after spring term at the Richmond groundwater hydrology field site. Enrolment limitations. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: EOSC 533.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 533"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 533",
        "title": "Advanced Groundwater Hydrology",
        "credits": 3,
        "desc": "Finite-difference models of steady-state and transient groundwater flow in the saturated and unsaturated zones; applications to regional groundwater flow, groundwater recharge, subsurface contributions to streamflow, and aquifer evaluation. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 534",
        "title": "Geological Engineering: Soils and Weak Rocks",
        "credits": 3,
        "desc": "Consult the credit exclusion list in the Faculty of Science section of the Calendar.  http://www.calendar.ubc.ca/vancouver/index.cfm?tree=12,215,410,414#4978 This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 535",
        "title": "Transport Processes in Porous Media",
        "credits": 3,
        "desc": "Transport of mass and heat in groundwater flow systems; modelling techniques including an introduction to the finite-element method; modelling of groundwater contamination. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 536",
        "title": "Advanced Rock Engineering",
        "credits": 3,
        "desc": "Consult the credit exclusion list in the Faculty of Science section of the Calendar.  http://www.calendar.ubc.ca/vancouver/index.cfm?tree=12,215,410,414#4978 This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 538",
        "title": "Diamond Exploration",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 539",
        "title": "Geochemistry of Hydrothermal Ore Deposits",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\nPrerequisite: Completion of a course in Economic Geology\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 540",
        "title": "Advanced Groundwater Geochemistry",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 541",
        "title": "Multi-component Reactive Transport Modelling in Groundwater",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\nPrerequisite: Either (a) EOSC 430 or (b) EOSC 540;  and EOSC 533.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 430",
            "EOSC 540",
            "EOSC 533"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 542",
        "title": "Advanced Volcanology",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 543",
        "title": "Topics in Solid Earth Sciences",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 544",
        "title": "Geodynamics",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 545",
        "title": "Advanced Models in Mineral Deposits",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 546",
        "title": "Advanced Field Methods in Earth Science",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 547",
        "title": "Tunneling and Underground Engineering",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 548",
        "title": "Graduating Paper for Masters Candidates without Thesis",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 549",
        "title": "Master's Thesis",
        "credits": 6,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 550",
        "title": "Linear Inverse Theory",
        "credits": 3,
        "desc": "Model construction, appraisal of nonuniqueness, and inference in linear problems. Tomographic inversions. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 552",
        "title": "Geomagnetism and Aeronomy",
        "credits": 2,
        "desc": "Description of the geomagnetic field, dynamo theory of the origin of the geomagnetic field, transient magnetic variations, magnetic storms and ionospheric disturbances. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 554",
        "title": "Theoretical Glaciology",
        "credits": 2,
        "desc": "Lectures and seminars on theoretical aspects of glacier mechanics; flow, stress and temperature fields, sliding theory, flow instabilities. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 555",
        "title": "Nonlinear Inverse Theory",
        "credits": 2,
        "desc": "Model construction, appraisal of nonuniqueness, and inference in nonlinear problems. Stochastic inverses, constrained optimization, joint inversions and image processing. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 556",
        "title": "Studies in Applied Geophysics",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 561",
        "title": "Theory and Methods in Seismic Interpretation",
        "credits": 2,
        "desc": "Topics to be selected from the following: forward modelling, analysis and inversion procedures as used in multichannel reflection, wide-angle reflection and refraction studies of the lithosphere. Velocity analyses, wave equation migration, dip moveout, synthetic seismograms, tomographic inversion, one-dimensional synthetic seismograms, tau-p methods, waveform inversion, two-dimensional ray tracing and synthetic seismograms, tomographic inversion. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 562",
        "title": "Mechanics of Earthquakes and Faulting",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 570",
        "title": "Paleoceanography",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 571",
        "title": "Seminar in Physical Oceanography and Atmospheric Science",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 573",
        "title": "Methods in Oceanography",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 575",
        "title": "The Biology and Ecology of Marine Zooplanktonic Organisms",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 576",
        "title": "Inorganic Chemical Tracers in the Study of Marine Systems",
        "credits": 3,
        "desc": "The chemical composition of seawater, cycles of gases, trace metals and radionuclides within the sea, chemical tracers in the study of water mixing, water movement and changes in ocean currents over time. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 578",
        "title": "Seminal Papers in Biological Oceanography",
        "credits": 5,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 579",
        "title": "Dynamic Oceanography",
        "credits": 1,
        "desc": "Consult the Credit Exclusion List in the Faculty of Science section of the Calendar. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: EOSC 512.\n",
        "coreqs": [],
        "prereqs": [
            "EOSC 512"
        ],
        "postreqs": []
    },
    {
        "name": "EOSC 582",
        "title": "Satellite Remote Sensing: Applications to Oceanography and Meteorology",
        "credits": 3,
        "desc": "A review of the satellite-sensed data products used in research and operational aspects of oceanography and meteorology. This course is not eligible for Credit/D/Fail grading. \nEquivalency: GEOG 515.\r\n\t",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 583",
        "title": "Circulation Processes and Transport Mechanisms in Observational Oceanography",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 584",
        "title": "Topics in Biological Oceanography",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 585",
        "title": "Topics in Physical Oceanography",
        "credits": 2,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 595",
        "title": "Directed Studies",
        "credits": 1,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 598",
        "title": "M.Eng. Graduating Paper",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 599",
        "title": "Thesis",
        "credits": 6,
        "desc": "For M.A.Sc. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 649",
        "title": "Doctoral Dissertation",
        "credits": 0,
        "desc": "\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "EOSC 699",
        "title": "Doctoral Dissertation",
        "credits": 0,
        "desc": "For Ph.D. (Engineering). \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    }
]