[
    {
        "name": "IGEN 201",
        "title": "Integrated Technical Communication",
        "credits": 3,
        "desc": "Written and oral communication in business correspondence, engineering design methods, report preparation, and oral presentations of technical material.  Restricted to students in second year of the Integrated Engineering Program. This course is not eligible for Credit/D/Fail grading. [1-0-2; 1-0-2]\nPrerequisite: One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\nCorequisite: IGEN 230.\nEquivalency: APSC 201.\r\n\t",
        "coreqs": [
            "IGEN 230"
        ],
        "prereqs": [
            "APSC 176",
            "ENGL 110",
            "ENGL 111",
            "ENGL 112",
            "ENGL 120",
            "ENGL 121",
            "WRDS 150"
        ],
        "postreqs": []
    },
    {
        "name": "IGEN 230",
        "title": "Introduction to Engineering Design",
        "credits": 6,
        "desc": "Introduction to engineering design methods, problem solving, working individually and in teams, and methods of communication of results. Engineering design projects will be assigned. Restricted to students in the second year of the Integrated Engineering program. This course is not eligible for Credit/D/Fail grading. [1-4-0;1-4-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "IGEN 330",
        "title": "Intermediate Engineering Design",
        "credits": 6,
        "desc": "Intermediate level engineering design projects involving material in the curriculum of the Integrated Engineering program. This course is not eligible for Credit/D/Fail grading. [1-4;1-4]\nPrerequisite: Third-year standing in the Integrated Engineering program.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "IGEN 340",
        "title": "Technology Entrepreneurship",
        "credits": 3,
        "desc": "Theory and skills needed for engineers to capitalize on the opportunities that exist in commercializing technology, including the relationships between ideas and opportunities, customers and competition, and products and solutions. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "IGEN 430",
        "title": "Advanced Engineering Design Projects",
        "credits": 6,
        "desc": "Projects involving all material in the curriculum of the Integrated Engineering Program. Students will be expected to propose a project and complete the design and construction of a prototype. Restricted to students in the fourth year of the Integrated Engineering program. This course is not eligible for Credit/D/Fail grading. [1-4-0;1-4-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": []
    },
    {
        "name": "IGEN 450",
        "title": "Pipeline Engineering",
        "credits": 3,
        "desc": "Pipeline materials and material selection; fracture mechanics; manufacturing and processing; welding and corrosion; soil-pipe interactions; surveying and site investigations; slope stability; natural hazards; pipeline loads and response. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Either (a) MECH 221 or (b) APSC 278 and one of CIVL 215, MTRL 263 and one of CIVL 230, MECH 260.\n",
        "coreqs": [],
        "prereqs": [
            "MECH 221",
            "APSC 278",
            "CIVL 215",
            "MTRL 263",
            "CIVL 230",
            "MECH 260"
        ],
        "postreqs": []
    },
    {
        "name": "IGEN 451",
        "title": "Pipeline Systems and Infrastructure",
        "credits": 3,
        "desc": "Energy infrastructure; pipe flows; equipment and facilities including compressors, pumping stations, coolers, and controls; terminals; pipeline integrity; corrosion control. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Either (a) MECH 221 or (b) APSC 278 and one of CIVL 215, MTRL 263 and one of CIVL 230, MECH 260.\n",
        "coreqs": [],
        "prereqs": [
            "MECH 221",
            "APSC 278",
            "CIVL 215",
            "MTRL 263",
            "CIVL 230",
            "MECH 260"
        ],
        "postreqs": []
    },
    {
        "name": "IGEN 452",
        "title": "Pipeline Design",
        "credits": 3,
        "desc": "Pipeline and pipeline system design reflecting technical, regulatory, environmental, societal, professional, and economic aspects; pipeline design project. This course is not eligible for Credit/D/Fail grading. [2-0-2]\nPrerequisite: IGEN 450.\n",
        "coreqs": [],
        "prereqs": [
            "IGEN 450"
        ],
        "postreqs": []
    }
]