[
    {
        "name": "MINE 200",
        "title": "Mineral Resources Engineering I",
        "credits": 7,
        "desc": "Introduction to the mining life cycle and the design, planning, operation, and closure of mining systems, with a focus on rock and mineral formation, mineralogy, mining methods, mineral processing, community engagement, and social license to operate. This course is not eligible for Credit/D/Fail grading. [6-2-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -369,
        "y": -171,
        "group": "mine"
    },
    {
        "name": "MINE 201",
        "title": "Mineral Resources Engineering II",
        "credits": 3,
        "desc": "The design, planning, and operation, and closure of mining operations, with a focus on mineral processing technologies, plant design, waste and tailings management, and the future of mining. This course is not eligible for Credit/D/Fail grading. [3-2-0]\nPrerequisite: MINE 200.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -370,
        "y": -163,
        "group": "mine"
    },
    {
        "name": "MINE 224",
        "title": "Mineralogy for Mining Engineering",
        "credits": 4,
        "desc": "Fundamentals of the rock and minerals formation. Exploring main techniques used to understand implications of mineralogy in mining and mineral processing. This course is not eligible for Credit/D/Fail grading. [3-2-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -371,
        "y": -155,
        "group": "mine"
    },
    {
        "name": "MINE 291",
        "title": "Introduction to Mining",
        "credits": 3,
        "desc": "Leading practices and technologies employed in the design, planning, and operation of mining systems. Life cycle of surface and underground mining systems. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -372,
        "y": -147,
        "group": "mine"
    },
    {
        "name": "MINE 292",
        "title": "Introduction to Mineral Processing",
        "credits": 3,
        "desc": "Overview; extracting a mineral or final product from an ore. This course is not eligible for Credit/D/Fail grading. [3-2-0]\nPrerequisite: MINE 224.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -374,
        "y": -140,
        "group": "mine"
    },
    {
        "name": "MINE 293",
        "title": "Seminar",
        "credits": 1,
        "desc": "Oral presentations of topics on mine safety by students. Graded on basis of presentations, summaries of guest speaker presentations, mining processes, and final exam. [1-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -377,
        "y": -133,
        "group": "mine"
    },
    {
        "name": "MINE 302",
        "title": "Underground Mining and Design",
        "credits": 4,
        "desc": "Selection, design, and development of underground mining methods based upon physical, geological, economic, and environmental constraints. Underground excavation methods and equipment selection. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: MINE 291.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -380,
        "y": -126,
        "group": "mine"
    },
    {
        "name": "MINE 303",
        "title": "Rock Mechanics Fundamentals",
        "credits": 4,
        "desc": "The study of the mechanical and structural properties of rock materials at the laboratory and field scale, with reference to common mining, geological and civil engineering problems. This course is not eligible for Credit/D/Fail grading. [3-2-0]\nPrerequisite: CIVL 210 and one of MECH 260, CIVL 230.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -384,
        "y": -119,
        "group": "mine"
    },
    {
        "name": "MINE 304",
        "title": "Rock Fragmentation",
        "credits": 3,
        "desc": "Theory and practice of rock fragmentation by drilling and blasting; introduction to explosives and initiation systems; design of surface and underground blasts; machine excavation systems for tunneling and stoping; environmental impacts, safety, and risk assessment. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: MINE 291.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -388,
        "y": -112,
        "group": "mine"
    },
    {
        "name": "MINE 310",
        "title": "Surface Mining and Design",
        "credits": 4,
        "desc": "Surface mining methods, calculation of pit limits, cutoff grades, break-even criteria, stripping ratios, ultimate pit depth and dimensions, and pit sequencing.  Geotechnical inputs to surface mine design.  Loading and hauling equipment, production rates, capacity and systems. This course is not eligible for Credit/D/Fail grading. [3-2-0]\nPrerequisite: All of MINE 291, MINE 292.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -393,
        "y": -106,
        "group": "mine"
    },
    {
        "name": "MINE 331",
        "title": "Physical Mineral Processes",
        "credits": 3,
        "desc": "Mineral processing unit operations and sampling, crushing, grinding, screening, classification, gravity separation, magnetic separation, electrostatic separation, concentrate dewatering practices. [3-3-0]\nPrerequisite: Third Year Standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -398,
        "y": -100,
        "group": "mine"
    },
    {
        "name": "MINE 333",
        "title": "Flotation",
        "credits": 3,
        "desc": "Theory and technology of flotation and ancillary processes. This course is not eligible for Credit/D/Fail grading. [2-3-0]\nPrerequisite: Third Year Standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -404,
        "y": -95,
        "group": "mine"
    },
    {
        "name": "MINE 350",
        "title": "Modelling and Simulation",
        "credits": 3,
        "desc": "Methods for determining the behaviour of large scale industrial systems and their application to the design and analysis of such systems. This course is not eligible for Credit/D/Fail grading. [2-2-0]\nPrerequisite: STAT 251.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -410,
        "y": -90,
        "group": "mine"
    },
    {
        "name": "MINE 380",
        "title": "Mine Waste Management",
        "credits": 3,
        "desc": "Basic geotechnical, hydrological, and water management aspects of mine waste management. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: CIVL 210. (and third-year standing)\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -416,
        "y": -86,
        "group": "mine"
    },
    {
        "name": "MINE 393",
        "title": "Seminar",
        "credits": 1,
        "desc": "Oral presentation of topics by instructor and guest lecturers. This course is not eligible for Credit/D/Fail grading. [1-0-0]\nPrerequisite: Third-year standing in Mining Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -423,
        "y": -82,
        "group": "mine"
    },
    {
        "name": "MINE 395",
        "title": "Mineral Deposit Modelling",
        "credits": 3,
        "desc": "Types of mineral deposits. Exploration and sampling methods. Methods for data analysis and computer modelling of mineral deposits and their use in production planning and design. This course is not eligible for Credit/D/Fail grading. [2-1-1]\nPrerequisite: All of MINE 291, MINE 292.\nCorequisite: STAT 251.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -430,
        "y": -79,
        "group": "mine"
    },
    {
        "name": "MINE 396",
        "title": "Engineering Economics",
        "credits": 3,
        "desc": "Discrete and continuous cash flow models, discounted cash flow analysis, effects of depreciation and taxes, economic analysis of projects, sensitivity and risk analysis, financing and cost of capital. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Second-year standing in Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -437,
        "y": -76,
        "group": "mine"
    },
    {
        "name": "MINE 402",
        "title": "Mine Ventilation and Occupational Health and Safety",
        "credits": 3,
        "desc": "Design and analysis for ventilation systems for mining. Topics such as ventilation design, ventilation surveys, thermodynamic aspects, psychrometry of air and air conditioning. This course is not eligible for Credit/D/Fail grading. [3-2-0]\nPrerequisite: MINE 291.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -444,
        "y": -74,
        "group": "mine"
    },
    {
        "name": "MINE 403",
        "title": "Rock Mechanics Design",
        "credits": 3,
        "desc": "The design of rock slopes and underground openings with respect to stress, structure and the rock mass. Stabilization and monitoring of rock movement. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: One of MINE 303, MINE 305.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -452,
        "y": -72,
        "group": "mine"
    },
    {
        "name": "MINE 404",
        "title": "Strategic Issues in Mining",
        "credits": 3,
        "desc": "Strategic issues in an organization; types of organizations; personnel evaluations and job rating systems; impact of manpower planning on decision-making; union negotiations; public relations; dealing with the media; corporate responsibilities to society and employees. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Third- or Fourth-year standing in Mining Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -460,
        "y": -71,
        "group": "mine"
    },
    {
        "name": "MINE 405",
        "title": "Introduction to Risk Management for Mining and Large Industrial Projects",
        "credits": 3,
        "desc": "Risk management and its application to mining and large industrial projects, including risk analysis, treatment, and governance. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Third-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -467,
        "y": -71,
        "group": "mine"
    },
    {
        "name": "MINE 406",
        "title": "Mine Project Valuation and Risk Assessment",
        "credits": 3,
        "desc": "Mineral economics and finance. Analytical tools and techniques used in the valuation of mining companies and the financial analysis and risk assessment methods. [2-2-0]\nPrerequisite: MINE 396.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -475,
        "y": -71,
        "group": "mine"
    },
    {
        "name": "MINE 420",
        "title": "Applied Geostatistics",
        "credits": 3,
        "desc": "Geostatistical analysis and simulation of spatiotemporal phenomena in natural and engineered systems with applications to mining problems. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: STAT 251.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -483,
        "y": -71,
        "group": "mine"
    },
    {
        "name": "MINE 432",
        "title": "Mineral Process Control",
        "credits": 3,
        "desc": "Automatic control theory, PID control, Laplace and z-transforms, loop tuning, frequency response, stability analysis, control strategies in flotation, comminution, dewatering, reagent and bin/sump levels, automated load-haul-dump and drilling equipment, instrumentation and soft sensors. This course is not eligible for Credit/D/Fail grading. [2-4-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -491,
        "y": -73,
        "group": "mine"
    },
    {
        "name": "MINE 434",
        "title": "Processing Precious Metal Ores",
        "credits": 3,
        "desc": "Process alternatives and mineralogical considerations; physical and chemical recovery technologies; environmental protection; flowsheet studies. This course is not eligible for Credit/D/Fail grading. [2-2-0]\nPrerequisite: MINE 331.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -498,
        "y": -75,
        "group": "mine"
    },
    {
        "name": "MINE 435",
        "title": "Plant and Process Design",
        "credits": 3,
        "desc": "Design of unit operations in a mineral processing plant including crushing, grinding, classification, gravity separation, magnetic separation, flotation, thickening and filtration. Equipment selection and sizing, flowsheet design, circuit analysis and processing options. This course is not eligible for Credit/D/Fail grading. [2-3-0]\nPrerequisite: MINE 331.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -505,
        "y": -77,
        "group": "mine"
    },
    {
        "name": "MINE 436",
        "title": "Industrial Mixing",
        "credits": 3,
        "desc": "Fundamentals of mixing technology, and industrial mixing systems and equipment. Selection, design, monitor, and scale-up mixing systems for mining applications. This course is not eligible for Credit/D/Fail grading. [2-2-2*]\nPrerequisite: MATH 255 and one of MECH 280, CIVL 215.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -512,
        "y": -80,
        "group": "mine"
    },
    {
        "name": "MINE 438",
        "title": "Advanced Process Mineralogy",
        "credits": 3,
        "desc": "Textural parameters, such as mineral liberation size and mineral associations in connection with the mineral processing techniques for mineral recovery. This course is not eligible for Credit/D/Fail grading. [3-0-2]\nPrerequisite: MINE 331.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -519,
        "y": -84,
        "group": "mine"
    },
    {
        "name": "MINE 455",
        "title": "Mine Water Management",
        "credits": 3,
        "desc": "Mine water management covering integrated water resource management, water balances, sources, water use optimization, water quality and treatment and long term stewardship. [2-2-0]\nPrerequisite: One of MINE 291, MINE 292.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -526,
        "y": -88,
        "group": "mine"
    },
    {
        "name": "MINE 462",
        "title": "Coal Preparation Technology",
        "credits": 3,
        "desc": "Thermal and metallurgical coals: objectives of their cleaning; coal washability and flotability fundamentals; coal preparation unit operations; performance characteristics of coal washing equipment; products dewatering; plant flowsheets. This course is not eligible for Credit/D/Fail grading. [2-3-0]\nPrerequisite: All of MINE 292, MINE 331.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -532,
        "y": -93,
        "group": "mine"
    },
    {
        "name": "MINE 465",
        "title": "Materials Handling",
        "credits": 3,
        "desc": "Knowledge and understanding of equipment used in mining operations, including diesel, electro-mechanical, hydraulic and pneumatic equipment as well as conveyors, load-haul-dump trucks and pumps. [2-2-0]\nPrerequisite: One of MINE 302, MINE 310.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -538,
        "y": -98,
        "group": "mine"
    },
    {
        "name": "MINE 470",
        "title": "Indigenous Peoples and Mining in Canada",
        "credits": 3,
        "desc": "Historical context of Indigenous peoples of Canada interactions with the development of mineral resources. Current best practices and systems supporting effective engagement and involvement of Indigenous peoples in the development of mines and mineral resources. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Third-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -543,
        "y": -103,
        "group": "mine"
    },
    {
        "name": "MINE 482",
        "title": "Maintenance Engineering",
        "credits": 3,
        "desc": "Analytical foundation for maintenance of industrial plant equipment and mobile equipment in various production environments; maintenance planning and management, life cycle analysis, reliability theory, total quality maintenance, condition monitoring. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Fourth-year standing.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -548,
        "y": -109,
        "group": "mine"
    },
    {
        "name": "MINE 485",
        "title": "Cave Mining Systems: Design and Planning",
        "credits": 3,
        "desc": "Designs, planning, and leading practices are applied to underground mining systems reliant on induced and controlled rock mass caving. This course is not eligible for Credit/D/Fail grading. [3-0-0]\nPrerequisite: Two of MINE 302, MINE 303, EOSC 323.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -553,
        "y": -116,
        "group": "mine"
    },
    {
        "name": "MINE 486",
        "title": "Mining and The Environment",
        "credits": 3,
        "desc": "Environmental topics of importance to engineers practicing within the mining, metallurgical and related industries including technical practices, regulatory and public issues. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -557,
        "y": -122,
        "group": "mine"
    },
    {
        "name": "MINE 488",
        "title": "Heavy Oil Sand Mining and Processing",
        "credits": 3,
        "desc": "Life cycle of the production of Oil Sands resources, including mining, bitumen extraction, and reclamation. This course is not eligible for Credit/D/Fail grading. [2-3-0]\nPrerequisite: MINE 310.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -560,
        "y": -129,
        "group": "mine"
    },
    {
        "name": "MINE 491",
        "title": "Mine and Plant Engineering Design Feasibility Study",
        "credits": 6,
        "desc": "Mining Engineering design project from scope definition to final design and project feasibility. Based on a problem from industry and/or research. This course is not eligible for Credit/D/Fail grading. [2-2-0; 2-2-0]\nPrerequisite: All of MINE 302, MINE 303, MINE 304, MINE 310, MINE 331, MINE 333, MINE 350, MINE 396. Fourth-year standing in Mining Engineering is required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -563,
        "y": -136,
        "group": "mine"
    },
    {
        "name": "MINE 493",
        "title": "Seminar",
        "credits": 1,
        "desc": "Oral presentation of a technical nature. Use of closed circuit television for personal evaluation. This course is not eligible for Credit/D/Fail grading. [0-0-1]\nPrerequisite: Fourth-year standing in Mining Engineering.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -566,
        "y": -144,
        "group": "mine"
    },
    {
        "name": "MINE 497",
        "title": "Directed Studies",
        "credits": 1,
        "desc": "Requires approval of the department head. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -567,
        "y": -151,
        "group": "mine"
    },
    {
        "name": "MINE 501",
        "title": "Topics for Engineers in the Mining Industry",
        "credits": 1,
        "desc": "Leading practices and technologies employed in the Canadian Mining Industry.  Topics include: mining, mineral processing, mine finance and mining and the environment. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -569,
        "y": -159,
        "group": "mine"
    },
    {
        "name": "MINE 504",
        "title": "Rock Fragmentation",
        "credits": 2,
        "desc": "Theory and practice of drilling and blasting; explosive types and strengths. Blast pattern design for underground and surface operations. Credit will be granted for only one of MINE 504 or MINE 565. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -569,
        "y": -167,
        "group": "mine"
    },
    {
        "name": "MINE 505",
        "title": "Advanced Topics in Rock Engineering",
        "credits": 3,
        "desc": "Rock mass properties and numerical modelling applied to rock engineering design with particular emphasis on applications in rock slopes and tunneling. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -569,
        "y": -174,
        "group": "mine"
    },
    {
        "name": "MINE 506",
        "title": "Mining Methods",
        "credits": 3,
        "desc": "A more advanced study of some aspects of mining methods. Credit will be granted for only one of MINE 506 or MINE 550. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -569,
        "y": -182,
        "group": "mine"
    },
    {
        "name": "MINE 507",
        "title": "Block Caving Systems",
        "credits": 3,
        "desc": "Mass mining (caving) methods, their design and operation, the value proposition and the key value drivers. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -567,
        "y": -190,
        "group": "mine"
    },
    {
        "name": "MINE 508",
        "title": "Integrated Mining and Processing Systems",
        "credits": 3,
        "desc": "Methods and systems for integrated mining and processing, conceptual model development, simulation, economic and technical evaluation. Credit will be granted for only one of MINE 508 or MINE 557. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -566,
        "y": -197,
        "group": "mine"
    },
    {
        "name": "MINE 509",
        "title": "Mine Ventilation",
        "credits": 3,
        "desc": "Mine air conditioning, ventilation network analysis, radioactivity in mining, case studies in mine ventilation and control of dust, fumes and diesel exhausts. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -563,
        "y": -205,
        "group": "mine"
    },
    {
        "name": "MINE 515",
        "title": "Future of Mining",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -560,
        "y": -212,
        "group": "mine"
    },
    {
        "name": "MINE 520",
        "title": "Advanced Coal Preparation",
        "credits": 3,
        "desc": "Thermal and metallurgical coals. Desulphurization Theory of coal beneficiation. Dense media separation. Coal surface properties and their effect on fine coal processing by flotation and oil agglomeration; coal/water/slurries. Plant performance testing and instrumentation. Credit will be granted for only one of MINE 520 or MINE 566. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -557,
        "y": -219,
        "group": "mine"
    },
    {
        "name": "MINE 521",
        "title": "Advanced Flotation Technology",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -553,
        "y": -225,
        "group": "mine"
    },
    {
        "name": "MINE 522",
        "title": "Processing of Mineral Fines",
        "credits": 2,
        "desc": "Particulate systems. Role of particle size and interfacial phenomena in properties of disperse systems. Stability of colloids and suspensions DLVO (Dejaguin-Landau-Vervey-Overbeek). Credit will be granted for only one of MINE 522 or MINE 572. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -548,
        "y": -232,
        "group": "mine"
    },
    {
        "name": "MINE 524",
        "title": "Processing of Precious Metal Ores",
        "credits": 3,
        "desc": "Advances in science and technology for recovering gold, silver, and platinum group elements. Credit will be granted for only one of MINE 524 or MINE 577. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -543,
        "y": -238,
        "group": "mine"
    },
    {
        "name": "MINE 526",
        "title": "Mathematical Modelling of Mineral Processes",
        "credits": 3,
        "desc": "Emphasis on crushing, grinding, screening, classification and flotation. Credit will be granted for only one of MINE 526 or MINE 575. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -538,
        "y": -243,
        "group": "mine"
    },
    {
        "name": "MINE 527",
        "title": "Simulation and Optimization of Mineral Processes",
        "credits": 3,
        "desc": "Mineral process simulators including off-line optimization strategies; optimal flow sheet design. Credit will be granted for only one of MINE 527 or MINE 576. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: One of MINE 526, MINE 575.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -532,
        "y": -248,
        "group": "mine"
    },
    {
        "name": "MINE 529",
        "title": "Rheology of Mineral Suspensions",
        "credits": 3,
        "desc": "Rheological measurements, flow curve modelling, micro-rheology, control of rheological properties. Application to mineral processing unit operations. Credit will be granted for only one of MINE 529 or MINE 579. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -526,
        "y": -253,
        "group": "mine"
    },
    {
        "name": "MINE 533",
        "title": "Treatment of Mineral Industry Effluents",
        "credits": 2,
        "desc": "Characteristics of mineral dispersions in gases and in water; dust suppression in mining and in mineral transport facilities; solid-liquid separations; removal of noxious chemicals; waste disposal systems. Credit will be granted for only one of MINE 533 or MINE 573. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: Permission of instructor is required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -519,
        "y": -257,
        "group": "mine"
    },
    {
        "name": "MINE 540",
        "title": "Acid Rock Drainage",
        "credits": 3,
        "desc": "Lectures and seminars on topics of importance in acid rock drainage including fundamentals of ARD generation, prediction, prevention, control, treatment and monitoring for waste management and regulatory control in the mining industry. Credit will be granted for only one of MINE 540 or MINE 580. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -512,
        "y": -261,
        "group": "mine"
    },
    {
        "name": "MINE 541",
        "title": "Environmental Risk Assessments in Relation to Mining",
        "credits": 3,
        "desc": "Advanced topics related to mining environment selected in consultation with the instructor. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -505,
        "y": -264,
        "group": "mine"
    },
    {
        "name": "MINE 544",
        "title": "Mining Environment Case Studies",
        "credits": 3,
        "desc": "Regulatory requirements for mine-mill environmental protection in design, operation and closure. Studies of environmental impact statements and closure plans. Credit will be granted for only one of MINE 544 or MINE 574. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -498,
        "y": -266,
        "group": "mine"
    },
    {
        "name": "MINE 547",
        "title": "Industrial Expert Systems",
        "credits": 3,
        "desc": "The use of artificial intelligence to solve complex problems in industry. Topics include knowledge acquisition, knowledge representation, knowledge accumulation, and conflict resolution. Credit will be granted for only one of MINE 547 or MINE 578. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -491,
        "y": -268,
        "group": "mine"
    },
    {
        "name": "MINE 551",
        "title": "Applied Underground Rock Mechanics",
        "credits": 3,
        "desc": "Study of design methods; underground engineering of openings, pillars and support. Emphasis on design with input being stress, structure and rock mass, employing analytical, empirical and numerical tools. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -483,
        "y": -270,
        "group": "mine"
    },
    {
        "name": "MINE 552",
        "title": "Mining Geostatistics",
        "credits": 3,
        "desc": "Basic geostatistical concepts. Applications of geostatistical techniques and stochastic simulation to orebody modelling and grade control. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -475,
        "y": -270,
        "group": "mine"
    },
    {
        "name": "MINE 553",
        "title": "Modelling of Industrial Systems",
        "credits": 3,
        "desc": "Use of mathematical programming, network theory, queuing models and simulation to model service and production operations in industry. Use of models in decision-making. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -467,
        "y": -270,
        "group": "mine"
    },
    {
        "name": "MINE 554",
        "title": "Mine Economics and Finance",
        "credits": 3,
        "desc": "Mine valuation using discounted cash flow analysis and option pricing methods. Sources of mine finance and requirements. Sensitivity and risk assessment. Introduction to metals marketing, hedging and risk management. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -460,
        "y": -270,
        "group": "mine"
    },
    {
        "name": "MINE 555",
        "title": "Mining and Society",
        "credits": 3,
        "desc": "Discussion of social, political and technical topics concerning mining-related activities. Credit will be granted for only one of MINE 555 or MINE 583. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -452,
        "y": -269,
        "group": "mine"
    },
    {
        "name": "MINE 559",
        "title": "Indigenous Peoples and Mining in Canada",
        "credits": 3,
        "desc": "Credit will be granted for only one of MINE 559 or MINE 585. This course is not eligible for Credit/D/Fail grading. [3-0-0]\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -444,
        "y": -267,
        "group": "mine"
    },
    {
        "name": "MINE 581",
        "title": "Safety of Tailings Storage Facilities",
        "credits": 3,
        "desc": "Safety evaluation of tailings storage facilities as a system, including tailings transport and containment structures. Consequence classifications. Credible failure modes. Breach analyses. Risk management and reporting. Emergency planning. Critical controls. Change management. Governance frameworks. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: Permission of instructor is required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -437,
        "y": -265,
        "group": "mine"
    },
    {
        "name": "MINE 582",
        "title": "Maintenance Engineering",
        "credits": 3,
        "desc": "The analytical foundation for maintenance of industrial plant equipment and mobile equipment in various production environments. Reliability theory, sensing technology and theory, risk analysis, and operations research applied to maintenance management. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -430,
        "y": -262,
        "group": "mine"
    },
    {
        "name": "MINE 584",
        "title": "Energy from the Earth: Renewable Versus Conventional",
        "credits": 3,
        "desc": "Coal, oil, gas, uranium, hydro, wind, geothermal, and geosolar. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -423,
        "y": -259,
        "group": "mine"
    },
    {
        "name": "MINE 585",
        "title": "Risk Management of Tailings Storage Facilities",
        "credits": 3,
        "desc": " This course is not eligible for Credit/D/Fail grading.\nPrerequisite: MINE 581.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -416,
        "y": -255,
        "group": "mine"
    },
    {
        "name": "MINE 586",
        "title": "Advanced Mine Waste Management",
        "credits": 3,
        "desc": "Advanced geotechnical, hydrological, and water management aspects of mine waste management. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -410,
        "y": -251,
        "group": "mine"
    },
    {
        "name": "MINE 587",
        "title": "Advanced Mine Site Management",
        "credits": 3,
        "desc": "Advanced mine site management topics including site and corporate governance and responsibility for mine waste facilities, specifically tailings; the role and responsibilities of the Engineer of Record; geochemistry of mine waste and mine closure realities. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -404,
        "y": -246,
        "group": "mine"
    },
    {
        "name": "MINE 588",
        "title": "Risk Assessment for Mine Waste Management",
        "credits": 3,
        "desc": "Risk assessment and management topics including risk assessment methodologies, risk management, and decision-making under risk. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -398,
        "y": -241,
        "group": "mine"
    },
    {
        "name": "MINE 589",
        "title": "Mine Waste Management Case Studies",
        "credits": 3,
        "desc": "Case study analysis including design, construction, operations and closure of mine waste facilities. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -393,
        "y": -235,
        "group": "mine"
    },
    {
        "name": "MINE 590",
        "title": "Special Advanced Topics",
        "credits": 1,
        "desc": "A special advanced course may be arranged upon the approval of the department head. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: Permission of instructor is required.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -388,
        "y": -229,
        "group": "mine"
    },
    {
        "name": "MINE 591",
        "title": "Communication Skills and Workplace Readiness",
        "credits": 1,
        "desc": "Preparation for mining and mineral processing engineering internships.  The course includes workshops on the following topics:  developing a synopsis of qualifications, written communication and interviewing skills for the engineering professional. Pass/fail. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -384,
        "y": -222,
        "group": "mine"
    },
    {
        "name": "MINE 592",
        "title": "Mining Industry Internship",
        "credits": 3,
        "desc": "Mining or mineral processing engineering internship in which concepts, theory and practice of mining and mineral processing engineering are applied by working with industry on appropriate technical projects. Pass/fail. This course is not eligible for Credit/D/Fail grading. \nPrerequisite: MINE 591.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -380,
        "y": -215,
        "group": "mine"
    },
    {
        "name": "MINE 597",
        "title": "Engineering Project",
        "credits": 6,
        "desc": "A project involving laboratory, pilot plant or field work is to be completed in close collaboration with an academic advisor. For M.Eng. students only. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -377,
        "y": -208,
        "group": "mine"
    },
    {
        "name": "MINE 598",
        "title": "Seminar",
        "credits": 2,
        "desc": "Topics in mining, mineral processing and the environment for M.A.Sc. and M.Eng. students. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -374,
        "y": -201,
        "group": "mine"
    },
    {
        "name": "MINE 599",
        "title": "M.A.Sc. Thesis",
        "credits": 6,
        "desc": " This course is not eligible for Credit/D/Fail grading.\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -372,
        "y": -194,
        "group": "mine"
    },
    {
        "name": "MINE 698",
        "title": "Seminar",
        "credits": 2,
        "desc": "Topics in mining and mineral processing for Ph.D. students. This course is not eligible for Credit/D/Fail grading. \n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -371,
        "y": -186,
        "group": "mine"
    },
    {
        "name": "MINE 699",
        "title": "Doctoral Dissertation",
        "credits": 0,
        "desc": "\n",
        "coreqs": [],
        "prereqs": [],
        "postreqs": [],
        "x": -370,
        "y": -178,
        "group": "mine"
    }
]